iSYSTEMLabs/winIDEAExampleWorkspaces/Cypress/PSoC4HVPA/emptyTargetInit/PSoC4HV_SFR.h
#include <stdint.h>

struct PERI_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL_DIV:6;
      uint64_t SEL_TYPE:2;
      uint64_t PA_SEL_DIV:6;
      uint64_t PA_SEL_TYPE:2;
      uint64_t reservedSpace0:14;
      uint64_t DISABLE:1;
      uint64_t ENABLE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_CMD;

  uint8_t res0[252];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL_DIV:6;
      uint64_t SEL_TYPE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCLK_CTL_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL_DIV:6;
      uint64_t SEL_TYPE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCLK_CTL_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL_DIV:6;
      uint64_t SEL_TYPE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCLK_CTL_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL_DIV:6;
      uint64_t SEL_TYPE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCLK_CTL_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL_DIV:6;
      uint64_t SEL_TYPE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCLK_CTL_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL_DIV:6;
      uint64_t SEL_TYPE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCLK_CTL_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL_DIV:6;
      uint64_t SEL_TYPE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCLK_CTL_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL_DIV:6;
      uint64_t SEL_TYPE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCLK_CTL_7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL_DIV:6;
      uint64_t SEL_TYPE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCLK_CTL_8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL_DIV:6;
      uint64_t SEL_TYPE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCLK_CTL_9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL_DIV:6;
      uint64_t SEL_TYPE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCLK_CTL_10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL_DIV:6;
      uint64_t SEL_TYPE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCLK_CTL_11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL_DIV:6;
      uint64_t SEL_TYPE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCLK_CTL_12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL_DIV:6;
      uint64_t SEL_TYPE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCLK_CTL_13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL_DIV:6;
      uint64_t SEL_TYPE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCLK_CTL_14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL_DIV:6;
      uint64_t SEL_TYPE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCLK_CTL_15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL_DIV:6;
      uint64_t SEL_TYPE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCLK_CTL_16;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL_DIV:6;
      uint64_t SEL_TYPE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCLK_CTL_17;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL_DIV:6;
      uint64_t SEL_TYPE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCLK_CTL_18;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL_DIV:6;
      uint64_t SEL_TYPE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCLK_CTL_19;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL_DIV:6;
      uint64_t SEL_TYPE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCLK_CTL_20;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL_DIV:6;
      uint64_t SEL_TYPE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCLK_CTL_21;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL_DIV:6;
      uint64_t SEL_TYPE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCLK_CTL_22;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL_DIV:6;
      uint64_t SEL_TYPE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCLK_CTL_23;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL_DIV:6;
      uint64_t SEL_TYPE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCLK_CTL_24;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL_DIV:6;
      uint64_t SEL_TYPE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCLK_CTL_25;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL_DIV:6;
      uint64_t SEL_TYPE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCLK_CTL_26;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL_DIV:6;
      uint64_t SEL_TYPE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCLK_CTL_27;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL_DIV:6;
      uint64_t SEL_TYPE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCLK_CTL_28;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL_DIV:6;
      uint64_t SEL_TYPE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCLK_CTL_29;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL_DIV:6;
      uint64_t SEL_TYPE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCLK_CTL_30;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL_DIV:6;
      uint64_t SEL_TYPE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCLK_CTL_31;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL_DIV:6;
      uint64_t SEL_TYPE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCLK_CTL_32;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL_DIV:6;
      uint64_t SEL_TYPE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCLK_CTL_33;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL_DIV:6;
      uint64_t SEL_TYPE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCLK_CTL_34;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL_DIV:6;
      uint64_t SEL_TYPE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCLK_CTL_35;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL_DIV:6;
      uint64_t SEL_TYPE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCLK_CTL_36;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL_DIV:6;
      uint64_t SEL_TYPE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCLK_CTL_37;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL_DIV:6;
      uint64_t SEL_TYPE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCLK_CTL_38;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL_DIV:6;
      uint64_t SEL_TYPE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCLK_CTL_39;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL_DIV:6;
      uint64_t SEL_TYPE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCLK_CTL_40;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL_DIV:6;
      uint64_t SEL_TYPE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCLK_CTL_41;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL_DIV:6;
      uint64_t SEL_TYPE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCLK_CTL_42;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL_DIV:6;
      uint64_t SEL_TYPE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCLK_CTL_43;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL_DIV:6;
      uint64_t SEL_TYPE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCLK_CTL_44;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL_DIV:6;
      uint64_t SEL_TYPE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCLK_CTL_45;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL_DIV:6;
      uint64_t SEL_TYPE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCLK_CTL_46;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL_DIV:6;
      uint64_t SEL_TYPE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCLK_CTL_47;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL_DIV:6;
      uint64_t SEL_TYPE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCLK_CTL_48;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL_DIV:6;
      uint64_t SEL_TYPE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCLK_CTL_49;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL_DIV:6;
      uint64_t SEL_TYPE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCLK_CTL_50;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL_DIV:6;
      uint64_t SEL_TYPE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCLK_CTL_51;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL_DIV:6;
      uint64_t SEL_TYPE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCLK_CTL_52;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL_DIV:6;
      uint64_t SEL_TYPE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCLK_CTL_53;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL_DIV:6;
      uint64_t SEL_TYPE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCLK_CTL_54;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL_DIV:6;
      uint64_t SEL_TYPE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCLK_CTL_55;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL_DIV:6;
      uint64_t SEL_TYPE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCLK_CTL_56;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL_DIV:6;
      uint64_t SEL_TYPE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCLK_CTL_57;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL_DIV:6;
      uint64_t SEL_TYPE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCLK_CTL_58;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL_DIV:6;
      uint64_t SEL_TYPE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCLK_CTL_59;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL_DIV:6;
      uint64_t SEL_TYPE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCLK_CTL_60;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL_DIV:6;
      uint64_t SEL_TYPE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCLK_CTL_61;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL_DIV:6;
      uint64_t SEL_TYPE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCLK_CTL_62;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL_DIV:6;
      uint64_t SEL_TYPE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCLK_CTL_63;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:7;
      uint64_t INT8_DIV:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_8_CTL_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:7;
      uint64_t INT8_DIV:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_8_CTL_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:7;
      uint64_t INT8_DIV:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_8_CTL_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:7;
      uint64_t INT8_DIV:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_8_CTL_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:7;
      uint64_t INT8_DIV:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_8_CTL_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:7;
      uint64_t INT8_DIV:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_8_CTL_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:7;
      uint64_t INT8_DIV:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_8_CTL_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:7;
      uint64_t INT8_DIV:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_8_CTL_7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:7;
      uint64_t INT8_DIV:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_8_CTL_8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:7;
      uint64_t INT8_DIV:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_8_CTL_9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:7;
      uint64_t INT8_DIV:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_8_CTL_10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:7;
      uint64_t INT8_DIV:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_8_CTL_11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:7;
      uint64_t INT8_DIV:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_8_CTL_12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:7;
      uint64_t INT8_DIV:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_8_CTL_13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:7;
      uint64_t INT8_DIV:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_8_CTL_14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:7;
      uint64_t INT8_DIV:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_8_CTL_15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:7;
      uint64_t INT8_DIV:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_8_CTL_16;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:7;
      uint64_t INT8_DIV:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_8_CTL_17;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:7;
      uint64_t INT8_DIV:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_8_CTL_18;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:7;
      uint64_t INT8_DIV:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_8_CTL_19;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:7;
      uint64_t INT8_DIV:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_8_CTL_20;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:7;
      uint64_t INT8_DIV:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_8_CTL_21;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:7;
      uint64_t INT8_DIV:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_8_CTL_22;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:7;
      uint64_t INT8_DIV:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_8_CTL_23;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:7;
      uint64_t INT8_DIV:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_8_CTL_24;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:7;
      uint64_t INT8_DIV:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_8_CTL_25;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:7;
      uint64_t INT8_DIV:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_8_CTL_26;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:7;
      uint64_t INT8_DIV:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_8_CTL_27;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:7;
      uint64_t INT8_DIV:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_8_CTL_28;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:7;
      uint64_t INT8_DIV:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_8_CTL_29;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:7;
      uint64_t INT8_DIV:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_8_CTL_30;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:7;
      uint64_t INT8_DIV:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_8_CTL_31;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:7;
      uint64_t INT8_DIV:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_8_CTL_32;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:7;
      uint64_t INT8_DIV:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_8_CTL_33;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:7;
      uint64_t INT8_DIV:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_8_CTL_34;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:7;
      uint64_t INT8_DIV:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_8_CTL_35;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:7;
      uint64_t INT8_DIV:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_8_CTL_36;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:7;
      uint64_t INT8_DIV:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_8_CTL_37;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:7;
      uint64_t INT8_DIV:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_8_CTL_38;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:7;
      uint64_t INT8_DIV:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_8_CTL_39;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:7;
      uint64_t INT8_DIV:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_8_CTL_40;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:7;
      uint64_t INT8_DIV:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_8_CTL_41;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:7;
      uint64_t INT8_DIV:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_8_CTL_42;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:7;
      uint64_t INT8_DIV:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_8_CTL_43;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:7;
      uint64_t INT8_DIV:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_8_CTL_44;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:7;
      uint64_t INT8_DIV:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_8_CTL_45;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:7;
      uint64_t INT8_DIV:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_8_CTL_46;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:7;
      uint64_t INT8_DIV:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_8_CTL_47;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:7;
      uint64_t INT8_DIV:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_8_CTL_48;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:7;
      uint64_t INT8_DIV:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_8_CTL_49;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:7;
      uint64_t INT8_DIV:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_8_CTL_50;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:7;
      uint64_t INT8_DIV:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_8_CTL_51;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:7;
      uint64_t INT8_DIV:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_8_CTL_52;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:7;
      uint64_t INT8_DIV:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_8_CTL_53;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:7;
      uint64_t INT8_DIV:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_8_CTL_54;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:7;
      uint64_t INT8_DIV:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_8_CTL_55;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:7;
      uint64_t INT8_DIV:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_8_CTL_56;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:7;
      uint64_t INT8_DIV:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_8_CTL_57;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:7;
      uint64_t INT8_DIV:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_8_CTL_58;

