iSYSTEMLabs/winIDEAExampleWorkspaces/Cypress/PSoC4HVPA/emptyTargetInit/PSoC4HV_SFR.h
  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:7;
      uint64_t INT8_DIV:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_8_CTL_59;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:7;
      uint64_t INT8_DIV:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_8_CTL_60;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:7;
      uint64_t INT8_DIV:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_8_CTL_61;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:7;
      uint64_t INT8_DIV:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_8_CTL_62;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:7;
      uint64_t INT8_DIV:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_8_CTL_63;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:7;
      uint64_t INT16_DIV:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_16_CTL_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:7;
      uint64_t INT16_DIV:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_16_CTL_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:7;
      uint64_t INT16_DIV:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_16_CTL_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:7;
      uint64_t INT16_DIV:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_16_CTL_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:7;
      uint64_t INT16_DIV:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_16_CTL_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:7;
      uint64_t INT16_DIV:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_16_CTL_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:7;
      uint64_t INT16_DIV:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_16_CTL_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:7;
      uint64_t INT16_DIV:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_16_CTL_7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:7;
      uint64_t INT16_DIV:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_16_CTL_8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:7;
      uint64_t INT16_DIV:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_16_CTL_9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:7;
      uint64_t INT16_DIV:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_16_CTL_10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:7;
      uint64_t INT16_DIV:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_16_CTL_11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:7;
      uint64_t INT16_DIV:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_16_CTL_12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:7;
      uint64_t INT16_DIV:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_16_CTL_13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:7;
      uint64_t INT16_DIV:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_16_CTL_14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:7;
      uint64_t INT16_DIV:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_16_CTL_15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:7;
      uint64_t INT16_DIV:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_16_CTL_16;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:7;
      uint64_t INT16_DIV:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_16_CTL_17;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:7;
      uint64_t INT16_DIV:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_16_CTL_18;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:7;
      uint64_t INT16_DIV:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_16_CTL_19;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:7;
      uint64_t INT16_DIV:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_16_CTL_20;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:7;
      uint64_t INT16_DIV:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_16_CTL_21;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:7;
      uint64_t INT16_DIV:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_16_CTL_22;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:7;
      uint64_t INT16_DIV:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_16_CTL_23;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:7;
      uint64_t INT16_DIV:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_16_CTL_24;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:7;
      uint64_t INT16_DIV:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_16_CTL_25;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:7;
      uint64_t INT16_DIV:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_16_CTL_26;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:7;
      uint64_t INT16_DIV:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_16_CTL_27;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:7;
      uint64_t INT16_DIV:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_16_CTL_28;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:7;
      uint64_t INT16_DIV:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_16_CTL_29;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:7;
      uint64_t INT16_DIV:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_16_CTL_30;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:7;
      uint64_t INT16_DIV:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_16_CTL_31;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:7;
      uint64_t INT16_DIV:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_16_CTL_32;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:7;
      uint64_t INT16_DIV:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_16_CTL_33;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:7;
      uint64_t INT16_DIV:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_16_CTL_34;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:7;
      uint64_t INT16_DIV:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_16_CTL_35;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:7;
      uint64_t INT16_DIV:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_16_CTL_36;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:7;
      uint64_t INT16_DIV:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_16_CTL_37;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:7;
      uint64_t INT16_DIV:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_16_CTL_38;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:7;
      uint64_t INT16_DIV:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_16_CTL_39;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:7;
      uint64_t INT16_DIV:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_16_CTL_40;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:7;
      uint64_t INT16_DIV:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_16_CTL_41;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:7;
      uint64_t INT16_DIV:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_16_CTL_42;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:7;
      uint64_t INT16_DIV:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_16_CTL_43;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:7;
      uint64_t INT16_DIV:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_16_CTL_44;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:7;
      uint64_t INT16_DIV:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_16_CTL_45;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:7;
      uint64_t INT16_DIV:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_16_CTL_46;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:7;
      uint64_t INT16_DIV:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_16_CTL_47;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:7;
      uint64_t INT16_DIV:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_16_CTL_48;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:7;
      uint64_t INT16_DIV:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_16_CTL_49;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:7;
      uint64_t INT16_DIV:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_16_CTL_50;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:7;
      uint64_t INT16_DIV:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_16_CTL_51;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:7;
      uint64_t INT16_DIV:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_16_CTL_52;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:7;
      uint64_t INT16_DIV:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_16_CTL_53;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:7;
      uint64_t INT16_DIV:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_16_CTL_54;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:7;
      uint64_t INT16_DIV:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_16_CTL_55;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:7;
      uint64_t INT16_DIV:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_16_CTL_56;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:7;
      uint64_t INT16_DIV:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_16_CTL_57;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:7;
      uint64_t INT16_DIV:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_16_CTL_58;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:7;
      uint64_t INT16_DIV:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_16_CTL_59;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:7;
      uint64_t INT16_DIV:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_16_CTL_60;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:7;
      uint64_t INT16_DIV:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_16_CTL_61;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:7;
      uint64_t INT16_DIV:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_16_CTL_62;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:7;
      uint64_t INT16_DIV:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_16_CTL_63;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:2;
      uint64_t FRAC5_DIV:5;
      uint64_t INT16_DIV:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_16_5_CTL_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:2;
      uint64_t FRAC5_DIV:5;
      uint64_t INT16_DIV:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_16_5_CTL_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:2;
      uint64_t FRAC5_DIV:5;
      uint64_t INT16_DIV:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_16_5_CTL_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:2;
      uint64_t FRAC5_DIV:5;
      uint64_t INT16_DIV:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_16_5_CTL_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:2;
      uint64_t FRAC5_DIV:5;
      uint64_t INT16_DIV:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_16_5_CTL_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:2;
      uint64_t FRAC5_DIV:5;
      uint64_t INT16_DIV:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_16_5_CTL_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:2;
      uint64_t FRAC5_DIV:5;
      uint64_t INT16_DIV:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_16_5_CTL_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:2;
      uint64_t FRAC5_DIV:5;
      uint64_t INT16_DIV:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_16_5_CTL_7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:2;
      uint64_t FRAC5_DIV:5;
      uint64_t INT16_DIV:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_16_5_CTL_8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:2;
      uint64_t FRAC5_DIV:5;
      uint64_t INT16_DIV:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_16_5_CTL_9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:2;
      uint64_t FRAC5_DIV:5;
      uint64_t INT16_DIV:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_16_5_CTL_10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:2;
      uint64_t FRAC5_DIV:5;
      uint64_t INT16_DIV:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_16_5_CTL_11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:2;
      uint64_t FRAC5_DIV:5;
      uint64_t INT16_DIV:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_16_5_CTL_12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:2;
      uint64_t FRAC5_DIV:5;
      uint64_t INT16_DIV:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_16_5_CTL_13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:2;
      uint64_t FRAC5_DIV:5;
      uint64_t INT16_DIV:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_16_5_CTL_14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:2;
      uint64_t FRAC5_DIV:5;
      uint64_t INT16_DIV:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_16_5_CTL_15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:2;
      uint64_t FRAC5_DIV:5;
      uint64_t INT16_DIV:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_16_5_CTL_16;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:2;
      uint64_t FRAC5_DIV:5;
      uint64_t INT16_DIV:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_16_5_CTL_17;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:2;
      uint64_t FRAC5_DIV:5;
      uint64_t INT16_DIV:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_16_5_CTL_18;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:2;
      uint64_t FRAC5_DIV:5;
      uint64_t INT16_DIV:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_16_5_CTL_19;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:2;
      uint64_t FRAC5_DIV:5;
      uint64_t INT16_DIV:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_16_5_CTL_20;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:2;
      uint64_t FRAC5_DIV:5;
      uint64_t INT16_DIV:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_16_5_CTL_21;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:2;
      uint64_t FRAC5_DIV:5;
      uint64_t INT16_DIV:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_16_5_CTL_22;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:2;
      uint64_t FRAC5_DIV:5;
      uint64_t INT16_DIV:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_16_5_CTL_23;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:2;
      uint64_t FRAC5_DIV:5;
      uint64_t INT16_DIV:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_16_5_CTL_24;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:2;
      uint64_t FRAC5_DIV:5;
      uint64_t INT16_DIV:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_16_5_CTL_25;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:2;
      uint64_t FRAC5_DIV:5;
      uint64_t INT16_DIV:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_16_5_CTL_26;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:2;
      uint64_t FRAC5_DIV:5;
      uint64_t INT16_DIV:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_16_5_CTL_27;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:2;
      uint64_t FRAC5_DIV:5;
      uint64_t INT16_DIV:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_16_5_CTL_28;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:2;
      uint64_t FRAC5_DIV:5;
      uint64_t INT16_DIV:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_16_5_CTL_29;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:2;
      uint64_t FRAC5_DIV:5;
      uint64_t INT16_DIV:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_16_5_CTL_30;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:2;
      uint64_t FRAC5_DIV:5;
      uint64_t INT16_DIV:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_16_5_CTL_31;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:2;
      uint64_t FRAC5_DIV:5;
      uint64_t INT16_DIV:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_16_5_CTL_32;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:2;
      uint64_t FRAC5_DIV:5;
      uint64_t INT16_DIV:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_16_5_CTL_33;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:2;
      uint64_t FRAC5_DIV:5;
      uint64_t INT16_DIV:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_16_5_CTL_34;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:2;
      uint64_t FRAC5_DIV:5;
      uint64_t INT16_DIV:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_16_5_CTL_35;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:2;
      uint64_t FRAC5_DIV:5;
      uint64_t INT16_DIV:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_16_5_CTL_36;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:2;
      uint64_t FRAC5_DIV:5;
      uint64_t INT16_DIV:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_16_5_CTL_37;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:2;
      uint64_t FRAC5_DIV:5;
      uint64_t INT16_DIV:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_16_5_CTL_38;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:2;
      uint64_t FRAC5_DIV:5;
      uint64_t INT16_DIV:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIV_16_5_CTL_39;

