iSYSTEMLabs/winIDEAExampleWorkspaces/Cypress/PSoC4HVPA/emptyTargetInit/PSoC4HV_SFR.h
};

#define PERI_TR_GROUP_3 (*(volatile struct PERI_TR_GROUP_3_tag *) 0x40012600)

struct HSIOM_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLOCK_SEL:1;
      uint64_t reservedSpace0:30;
      uint64_t ENABLED:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PUMP_CTL;

  uint8_t res0[252];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SWITCH_AA_SL:1;
      uint64_t SWITCH_AA_SR:1;
      uint64_t SWITCH_AA_S0:1;
      uint64_t reservedSpace0:1;
      uint64_t SWITCH_BB_SL:1;
      uint64_t SWITCH_BB_SR:1;
      uint64_t SWITCH_BB_S0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AMUX_SPLIT_CTL_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SWITCH_AA_SL:1;
      uint64_t SWITCH_AA_SR:1;
      uint64_t SWITCH_AA_S0:1;
      uint64_t reservedSpace0:1;
      uint64_t SWITCH_BB_SL:1;
      uint64_t SWITCH_BB_SR:1;
      uint64_t SWITCH_BB_S0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AMUX_SPLIT_CTL_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SWITCH_AA_SL:1;
      uint64_t SWITCH_AA_SR:1;
      uint64_t SWITCH_AA_S0:1;
      uint64_t reservedSpace0:1;
      uint64_t SWITCH_BB_SL:1;
      uint64_t SWITCH_BB_SR:1;
      uint64_t SWITCH_BB_S0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AMUX_SPLIT_CTL_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SWITCH_AA_SL:1;
      uint64_t SWITCH_AA_SR:1;
      uint64_t SWITCH_AA_S0:1;
      uint64_t reservedSpace0:1;
      uint64_t SWITCH_BB_SL:1;
      uint64_t SWITCH_BB_SR:1;
      uint64_t SWITCH_BB_S0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AMUX_SPLIT_CTL_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SWITCH_AA_SL:1;
      uint64_t SWITCH_AA_SR:1;
      uint64_t SWITCH_AA_S0:1;
      uint64_t reservedSpace0:1;
      uint64_t SWITCH_BB_SL:1;
      uint64_t SWITCH_BB_SR:1;
      uint64_t SWITCH_BB_S0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AMUX_SPLIT_CTL_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SWITCH_AA_SL:1;
      uint64_t SWITCH_AA_SR:1;
      uint64_t SWITCH_AA_S0:1;
      uint64_t reservedSpace0:1;
      uint64_t SWITCH_BB_SL:1;
      uint64_t SWITCH_BB_SR:1;
      uint64_t SWITCH_BB_S0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AMUX_SPLIT_CTL_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SWITCH_AA_SL:1;
      uint64_t SWITCH_AA_SR:1;
      uint64_t SWITCH_AA_S0:1;
      uint64_t reservedSpace0:1;
      uint64_t SWITCH_BB_SL:1;
      uint64_t SWITCH_BB_SR:1;
      uint64_t SWITCH_BB_S0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AMUX_SPLIT_CTL_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SWITCH_AA_SL:1;
      uint64_t SWITCH_AA_SR:1;
      uint64_t SWITCH_AA_S0:1;
      uint64_t reservedSpace0:1;
      uint64_t SWITCH_BB_SL:1;
      uint64_t SWITCH_BB_SR:1;
      uint64_t SWITCH_BB_S0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AMUX_SPLIT_CTL_7;

};

#define HSIOM (*(volatile struct HSIOM_tag *) 0x40022000)

struct HSIOM_PRT_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t IO0_SEL:4;
      uint64_t IO1_SEL:4;
      uint64_t IO2_SEL:4;
      uint64_t IO3_SEL:4;
      uint64_t IO4_SEL:4;
      uint64_t IO5_SEL:4;
      uint64_t IO6_SEL:4;
      uint64_t IO7_SEL:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORT_SEL;

};

#define HSIOM_PRT_0 (*(volatile struct HSIOM_PRT_0_tag *) 0x40020000)

struct HSIOM_PRT_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t IO0_SEL:4;
      uint64_t IO1_SEL:4;
      uint64_t IO2_SEL:4;
      uint64_t IO3_SEL:4;
      uint64_t IO4_SEL:4;
      uint64_t IO5_SEL:4;
      uint64_t IO6_SEL:4;
      uint64_t IO7_SEL:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORT_SEL;

};

#define HSIOM_PRT_1 (*(volatile struct HSIOM_PRT_1_tag *) 0x40020100)

struct HSIOM_PRT_2_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t IO0_SEL:4;
      uint64_t IO1_SEL:4;
      uint64_t IO2_SEL:4;
      uint64_t IO3_SEL:4;
      uint64_t IO4_SEL:4;
      uint64_t IO5_SEL:4;
      uint64_t IO6_SEL:4;
      uint64_t IO7_SEL:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PORT_SEL;

};

#define HSIOM_PRT_2 (*(volatile struct HSIOM_PRT_2_tag *) 0x40020200)

struct SRSSLT_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t POWER_MODE:4;
      uint64_t DEBUG_SESSION:1;
      uint64_t LPM_READY:1;
      uint64_t reservedSpace0:10;
      uint64_t OVER_TEMP_EN:1;
      uint64_t OVER_TEMP_THRESH:1;
      uint64_t SPARE:2;
      uint64_t reservedSpace1:3;
      uint64_t EXT_VCCD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWR_CONTROL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WAKEUP_HOLDOFF:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWR_KEY_DELAY;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DDFT0_SEL:4;
      uint64_t DDFT1_SEL:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWR_DDFT_SELECT;

  uint8_t res1[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t SWD_CONNECTED:1;
      uint64_t reservedSpace1:25;
      uint64_t BLOCK_ALT_XRES:1;
      uint64_t reservedSpace2:1;
      uint64_t TEST_KEY_DFT_EN:1;
      uint64_t TEST_MODE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TST_MODE;

  uint8_t res2[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HFCLK_SEL:2;
      uint64_t HFCLK_DIV:2;
      uint64_t PUMP_SEL:2;
      uint64_t SYSCLK_DIV:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLK_SELECT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:31;
      uint64_t ENABLE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLK_ILO_CONFIG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:31;
      uint64_t ENABLE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLK_IMO_CONFIG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DFT_SEL0:4;
      uint64_t DFT_DIV0:2;
      uint64_t DFT_EDGE0:1;
      uint64_t reservedSpace0:1;
      uint64_t DFT_SEL1:4;
      uint64_t DFT_DIV1:2;
      uint64_t DFT_EDGE1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLK_DFT_SELECT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t KEY:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WDT_DISABLE_KEY;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNTER:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WDT_COUNTER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MATCH:16;
      uint64_t IGNORE_BITS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WDT_MATCH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WDT_MATCH:1;
      uint64_t TEMP_HIGH:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SRSS_INTR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t TEMP_HIGH:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SRSS_INTR_SET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WDT_MATCH:1;
      uint64_t TEMP_HIGH:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SRSS_INTR_MASK;

