iSYSTEMLabs/winIDEAExampleWorkspaces/Cypress/PSoC4HVPA/emptyTargetInit/PSoC4HV_SFR.h
  uint8_t res3[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESET_WDT:1;
      uint64_t reservedSpace0:2;
      uint64_t RESET_PROT_FAULT:1;
      uint64_t RESET_SOFT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RES_CAUSE;

  uint8_t res4[3752];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REF_VTRIM:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWR_BG_TRIM1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REF_ITRIM:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWR_BG_TRIM2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FREQ:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLK_IMO_SELECT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OFFSET:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLK_IMO_TRIM1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSOFFSET:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLK_IMO_TRIM2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DPSLP_REF_TRIM:4;
      uint64_t SPARE_TRIM:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWR_PWRSYS_TRIM1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STEPSIZE:5;
      uint64_t TCTRIM:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLK_IMO_TRIM3;

};

#define SRSSLT (*(volatile struct SRSSLT_tag *) 0x40030000)

struct GPIO_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PORT_INT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTR_CAUSE;

  uint8_t res0[28];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPIOV1P2_DET;

};

#define GPIO (*(volatile struct GPIO_tag *) 0x40041000)

struct GPIO_PRT_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA0:1;
      uint64_t DATA1:1;
      uint64_t DATA2:1;
      uint64_t DATA3:1;
      uint64_t DATA4:1;
      uint64_t DATA5:1;
      uint64_t DATA6:1;
      uint64_t DATA7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA0:1;
      uint64_t DATA1:1;
      uint64_t DATA2:1;
      uint64_t DATA3:1;
      uint64_t DATA4:1;
      uint64_t DATA5:1;
      uint64_t DATA6:1;
      uint64_t DATA7:1;
      uint64_t FLT_DATA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DM0:3;
      uint64_t DM1:3;
      uint64_t DM2:3;
      uint64_t DM3:3;
      uint64_t DM4:3;
      uint64_t DM5:3;
      uint64_t DM6:3;
      uint64_t DM7:3;
      uint64_t PORT_VTRIP_SEL:1;
      uint64_t PORT_SLOW:1;
      uint64_t reservedSpace0:1;
      uint64_t PORT_HYST_TRIM:1;
      uint64_t PORT_SLEW_CTL:2;
      uint64_t PORT_IB_MODE_SEL:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EDGE0_SEL:2;
      uint64_t EDGE1_SEL:2;
      uint64_t EDGE2_SEL:2;
      uint64_t EDGE3_SEL:2;
      uint64_t EDGE4_SEL:2;
      uint64_t EDGE5_SEL:2;
      uint64_t EDGE6_SEL:2;
      uint64_t EDGE7_SEL:2;
      uint64_t FLT_EDGE_SEL:2;
      uint64_t FLT_SEL:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTR_CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA0:1;
      uint64_t DATA1:1;
      uint64_t DATA2:1;
      uint64_t DATA3:1;
      uint64_t DATA4:1;
      uint64_t DATA5:1;
      uint64_t DATA6:1;
      uint64_t DATA7:1;
      uint64_t FLT_DATA:1;
      uint64_t reservedSpace0:7;
      uint64_t PS_DATA0:1;
      uint64_t PS_DATA1:1;
      uint64_t PS_DATA2:1;
      uint64_t PS_DATA3:1;
      uint64_t PS_DATA4:1;
      uint64_t PS_DATA5:1;
      uint64_t PS_DATA6:1;
      uint64_t PS_DATA7:1;
      uint64_t PS_FLT_DATA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PAIR_VREG01_EN:1;
      uint64_t PAIR_IBUF01_SEL:1;
      uint64_t PAIR_VTRIP01_SEL:1;
      uint64_t PAIR_VREF01_SEL:2;
      uint64_t PAIR_VOH01_SEL:3;
      uint64_t PAIR_VREG23_EN:1;
      uint64_t PAIR_IBUF23_SEL:1;
      uint64_t PAIR_VTRIP23_SEL:1;
      uint64_t PAIR_VREF23_SEL:2;
      uint64_t PAIR_VOH23_SEL:3;
      uint64_t PAIR_VREG45_EN:1;
      uint64_t PAIR_IBUF45_SEL:1;
      uint64_t PAIR_VTRIP45_SEL:1;
      uint64_t PAIR_VREF45_SEL:2;
      uint64_t PAIR_VOH45_SEL:3;
      uint64_t PAIR_VREG67_EN:1;
      uint64_t PAIR_IBUF67_SEL:1;
      uint64_t PAIR_VTRIP67_SEL:1;
      uint64_t PAIR_VREF67_SEL:2;
      uint64_t PAIR_VOH67_SEL:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SIO;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INP_DIS0:1;
      uint64_t INP_DIS1:1;
      uint64_t INP_DIS2:1;
      uint64_t INP_DIS3:1;
      uint64_t INP_DIS4:1;
      uint64_t INP_DIS5:1;
      uint64_t INP_DIS6:1;
      uint64_t INP_DIS7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PC2;

  uint8_t res0[36];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DR_SET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DR_CLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DR_INV;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DS0:2;
      uint64_t DS1:2;
      uint64_t DS2:2;
      uint64_t DS3:2;
      uint64_t DS4:2;
      uint64_t DS5:2;
      uint64_t DS6:2;
      uint64_t DS7:2;
      uint64_t PORT_V1P2_VTRIP_SEL:1;
      uint64_t PORT_V1P2_IB_MODE_SEL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRIM0:2;
      uint64_t TRIM1:2;
      uint64_t TRIM2:2;
      uint64_t TRIM3:2;
      uint64_t TRIM4:2;
      uint64_t TRIM5:2;
      uint64_t TRIM6:2;
      uint64_t TRIM7:2;
      uint64_t FILT0_EN:1;
      uint64_t FILT1_EN:1;
      uint64_t FILT2_EN:1;
      uint64_t FILT3_EN:1;
      uint64_t FILT4_EN:1;
      uint64_t FILT5_EN:1;
      uint64_t FILT6_EN:1;
      uint64_t FILT7_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FILT_CONFIG;

  uint8_t res1[44];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REF_SEL:5;
      uint64_t reservedSpace0:3;
      uint64_t VREFGEN_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) VREFGEN;

