iSYSTEMLabs/winIDEAExampleWorkspaces/Cypress/PSoC4HVPA/emptyTargetInit/PSoC4HV_SFR.h
  uint8_t res0[36];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DR_SET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DR_CLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DR_INV;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DS0:2;
      uint64_t DS1:2;
      uint64_t DS2:2;
      uint64_t DS3:2;
      uint64_t DS4:2;
      uint64_t DS5:2;
      uint64_t DS6:2;
      uint64_t DS7:2;
      uint64_t PORT_V1P2_VTRIP_SEL:1;
      uint64_t PORT_V1P2_IB_MODE_SEL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRIM0:2;
      uint64_t TRIM1:2;
      uint64_t TRIM2:2;
      uint64_t TRIM3:2;
      uint64_t TRIM4:2;
      uint64_t TRIM5:2;
      uint64_t TRIM6:2;
      uint64_t TRIM7:2;
      uint64_t FILT0_EN:1;
      uint64_t FILT1_EN:1;
      uint64_t FILT2_EN:1;
      uint64_t FILT3_EN:1;
      uint64_t FILT4_EN:1;
      uint64_t FILT5_EN:1;
      uint64_t FILT6_EN:1;
      uint64_t FILT7_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FILT_CONFIG;

  uint8_t res1[44];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REF_SEL:5;
      uint64_t reservedSpace0:3;
      uint64_t VREFGEN_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) VREFGEN;

};

#define GPIO_PRT_2 (*(volatile struct GPIO_PRT_2_tag *) 0x40040200)

struct HVSS_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWR_GOOD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HVREG_STATUS;

  uint8_t res0[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RDIV_EN_0:1;
      uint64_t RDIV_EN_1:1;
      uint64_t RDIV_ACT_EN:1;
      uint64_t reservedSpace0:1;
      uint64_t RDIV_SCALE_0:1;
      uint64_t RDIV_SCALE_1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RDIV_CTL;

  uint8_t res1[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LIN_MODE:3;
      uint64_t reservedSpace0:1;
      uint64_t SL_ROUND:1;
      uint64_t reservedSpace1:3;
      uint64_t USE_ALT_INTERFACE:1;
      uint64_t reservedSpace2:22;
      uint64_t LIN_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LIN_CTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WAKEUP_TIMER:12;
      uint64_t reservedSpace0:4;
      uint64_t FAULT_TIMER:12;
      uint64_t reservedSpace1:2;
      uint64_t WAKEUP_TIMER_EN:1;
      uint64_t FAULT_TIMER_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LIN_TIMER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LIN_RXD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LIN_STATUS;

  uint8_t res2[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WAKEUP:1;
      uint64_t FAULT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LIN_INTR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WAKEUP:1;
      uint64_t FAULT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LIN_INTR_SET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WAKEUP:1;
      uint64_t FAULT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LIN_INTR_MASK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WAKEUP:1;
      uint64_t FAULT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LIN_INTR_MASKED;

};

#define HVSS (*(volatile struct HVSS_tag *) 0x40060000)

struct CPUSS_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t VECT_IN_RAM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CONFIG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCALL_COMMAND:16;
      uint64_t reservedSpace0:11;
      uint64_t DIS_RESET_VECT_REL:1;
      uint64_t PRIVILEGED:1;
      uint64_t ROM_ACCESS_EN:1;
      uint64_t HMASTER_0:1;
      uint64_t SYSCALL_REQ:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSREQ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCALL_ARG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSARG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROTECTION_MODE:4;
      uint64_t reservedSpace0:26;
      uint64_t FLASH_LOCK:1;
      uint64_t PROTECTION_LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PROTECTION;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BROM_PROT_LIMIT:8;
      uint64_t reservedSpace0:8;
      uint64_t SROM_PROT_LIMIT:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PRIV_ROM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RAM_PROT_LIMIT:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PRIV_RAM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLASH_PROT_LIMIT:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PRIV_FLASH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t RAM_WOUND:3;
      uint64_t reservedSpace1:1;
      uint64_t FLASH_WOUND:3;
      uint64_t reservedSpace2:1;
      uint64_t RAM1_WOUND:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WOUNDING;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DSI:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INT_SEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DSI_INT_PULSE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INT_MODE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DSI_NMI_PULSE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NMI_MODE;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLASH_WS:2;
      uint64_t reservedSpace0:2;
      uint64_t PREF_EN:1;
      uint64_t reservedSpace1:3;
      uint64_t FLASH_INVALIDATE:1;
      uint64_t reservedSpace2:7;
      uint64_t ARB:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLASH_CTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ROM_WS:1;
      uint64_t reservedSpace0:15;
      uint64_t ARB:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ROM_CTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t ARB:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAM_CTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t ARB:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAC_CTL;

  uint8_t res1[96];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RAM_PROT_LIMIT:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PRIV_RAM1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t ARB:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAM1_CTL;

