iSYSTEMLabs/winIDEAExampleWorkspaces/Cypress/PSoC4HVPA/emptyTargetInit/PSoC4HV_SFR.h
  uint8_t res2[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CPU_HALT_TSTOP_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MTB_CTL;

  uint8_t res3[76];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t ARB:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SL_CTL_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t ARB:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SL_CTL_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t ARB:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SL_CTL_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t ARB:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SL_CTL_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t ARB:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SL_CTL_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t ARB:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SL_CTL_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t ARB:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SL_CTL_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t ARB:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SL_CTL_7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t ARB:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SL_CTL_8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t ARB:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SL_CTL_9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t ARB:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SL_CTL_10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t ARB:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SL_CTL_11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t ARB:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SL_CTL_12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t ARB:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SL_CTL_13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t ARB:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SL_CTL_14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t ARB:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SL_CTL_15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t ARB:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SL_CTL_16;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t ARB:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SL_CTL_17;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t ARB:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SL_CTL_18;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t ARB:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SL_CTL_19;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t ARB:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SL_CTL_20;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t ARB:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SL_CTL_21;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t ARB:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SL_CTL_22;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t ARB:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SL_CTL_23;

};

#define CPUSS (*(volatile struct CPUSS_tag *) 0x40100000)

struct DMAC_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:31;
      uint64_t ENABLED:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTL;

  uint8_t res0[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_NR:16;
      uint64_t CH_ADDR:5;
      uint64_t reservedSpace0:3;
      uint64_t STATE:3;
      uint64_t reservedSpace1:1;
      uint64_t PRIO:2;
      uint64_t PING_PONG:1;
      uint64_t ACTIVE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATUS_SRC_ADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATUS_DST_ADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CH:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATUS_CH_ACT;

  uint8_t res1[96];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:28;
      uint64_t PRIO:2;
      uint64_t PING_PONG:1;
      uint64_t ENABLED:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH_CTL_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:28;
      uint64_t PRIO:2;
      uint64_t PING_PONG:1;
      uint64_t ENABLED:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH_CTL_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:28;
      uint64_t PRIO:2;
      uint64_t PING_PONG:1;
      uint64_t ENABLED:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH_CTL_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:28;
      uint64_t PRIO:2;
      uint64_t PING_PONG:1;
      uint64_t ENABLED:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH_CTL_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:28;
      uint64_t PRIO:2;
      uint64_t PING_PONG:1;
      uint64_t ENABLED:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH_CTL_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:28;
      uint64_t PRIO:2;
      uint64_t PING_PONG:1;
      uint64_t ENABLED:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH_CTL_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:28;
      uint64_t PRIO:2;
      uint64_t PING_PONG:1;
      uint64_t ENABLED:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH_CTL_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:28;
      uint64_t PRIO:2;
      uint64_t PING_PONG:1;
      uint64_t ENABLED:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH_CTL_7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:28;
      uint64_t PRIO:2;
      uint64_t PING_PONG:1;
      uint64_t ENABLED:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH_CTL_8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:28;
      uint64_t PRIO:2;
      uint64_t PING_PONG:1;
      uint64_t ENABLED:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH_CTL_9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:28;
      uint64_t PRIO:2;
      uint64_t PING_PONG:1;
      uint64_t ENABLED:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH_CTL_10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:28;
      uint64_t PRIO:2;
      uint64_t PING_PONG:1;
      uint64_t ENABLED:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH_CTL_11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:28;
      uint64_t PRIO:2;
      uint64_t PING_PONG:1;
      uint64_t ENABLED:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH_CTL_12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:28;
      uint64_t PRIO:2;
      uint64_t PING_PONG:1;
      uint64_t ENABLED:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH_CTL_13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:28;
      uint64_t PRIO:2;
      uint64_t PING_PONG:1;
      uint64_t ENABLED:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH_CTL_14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:28;
      uint64_t PRIO:2;
      uint64_t PING_PONG:1;
      uint64_t ENABLED:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH_CTL_15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:28;
      uint64_t PRIO:2;
      uint64_t PING_PONG:1;
      uint64_t ENABLED:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH_CTL_16;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:28;
      uint64_t PRIO:2;
      uint64_t PING_PONG:1;
      uint64_t ENABLED:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH_CTL_17;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:28;
      uint64_t PRIO:2;
      uint64_t PING_PONG:1;
      uint64_t ENABLED:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH_CTL_18;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:28;
      uint64_t PRIO:2;
      uint64_t PING_PONG:1;
      uint64_t ENABLED:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH_CTL_19;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:28;
      uint64_t PRIO:2;
      uint64_t PING_PONG:1;
      uint64_t ENABLED:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH_CTL_20;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:28;
      uint64_t PRIO:2;
      uint64_t PING_PONG:1;
      uint64_t ENABLED:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH_CTL_21;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:28;
      uint64_t PRIO:2;
      uint64_t PING_PONG:1;
      uint64_t ENABLED:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH_CTL_22;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:28;
      uint64_t PRIO:2;
      uint64_t PING_PONG:1;
      uint64_t ENABLED:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH_CTL_23;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:28;
      uint64_t PRIO:2;
      uint64_t PING_PONG:1;
      uint64_t ENABLED:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH_CTL_24;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:28;
      uint64_t PRIO:2;
      uint64_t PING_PONG:1;
      uint64_t ENABLED:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH_CTL_25;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:28;
      uint64_t PRIO:2;
      uint64_t PING_PONG:1;
      uint64_t ENABLED:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH_CTL_26;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:28;
      uint64_t PRIO:2;
      uint64_t PING_PONG:1;
      uint64_t ENABLED:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH_CTL_27;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:28;
      uint64_t PRIO:2;
      uint64_t PING_PONG:1;
      uint64_t ENABLED:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH_CTL_28;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:28;
      uint64_t PRIO:2;
      uint64_t PING_PONG:1;
      uint64_t ENABLED:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH_CTL_29;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:28;
      uint64_t PRIO:2;
      uint64_t PING_PONG:1;
      uint64_t ENABLED:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH_CTL_30;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:28;
      uint64_t PRIO:2;
      uint64_t PING_PONG:1;
      uint64_t ENABLED:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH_CTL_31;

  uint8_t res2[1776];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CH:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CH:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTR_SET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CH:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTR_MASK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CH:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTR_MASKED;

