iSYSTEMLabs/winIDEAExampleWorkspaces/Cypress/PSoC4HVPA/emptyTargetInit/PSoC4HV_SFR.h
};

#define DMAC (*(volatile struct DMAC_tag *) 0x40101000)

struct DMAC_DESCR_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PING_SRC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PING_DST;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_NR:16;
      uint64_t DATA_SIZE:2;
      uint64_t reservedSpace0:2;
      uint64_t DST_TRANSFER_SIZE:1;
      uint64_t DST_ADDR_INCR:1;
      uint64_t SRC_TRANSFER_SIZE:1;
      uint64_t SRC_ADDR_INCR:1;
      uint64_t WAIT_FOR_DEACT:2;
      uint64_t INV_DESCR:1;
      uint64_t SET_CAUSE:1;
      uint64_t PREEMPTABLE:1;
      uint64_t FLIPPING:1;
      uint64_t OPCODE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PING_CTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CURR_DATA_NR:16;
      uint64_t RESPONSE:3;
      uint64_t reservedSpace0:12;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PING_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PONG_SRC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PONG_DST;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_NR:16;
      uint64_t DATA_SIZE:2;
      uint64_t reservedSpace0:2;
      uint64_t DST_TRANSFER_SIZE:1;
      uint64_t DST_ADDR_INCR:1;
      uint64_t SRC_TRANSFER_SIZE:1;
      uint64_t SRC_ADDR_INCR:1;
      uint64_t WAIT_FOR_DEACT:2;
      uint64_t INV_DESCR:1;
      uint64_t SET_CAUSE:1;
      uint64_t PREEMPTABLE:1;
      uint64_t FLIPPING:1;
      uint64_t OPCODE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PONG_CTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CURR_DATA_NR:16;
      uint64_t RESPONSE:3;
      uint64_t reservedSpace0:12;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PONG_STATUS;

};

#define DMAC_DESCR_0 (*(volatile struct DMAC_DESCR_0_tag *) 0x40101800)

struct DMAC_DESCR_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PING_SRC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PING_DST;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_NR:16;
      uint64_t DATA_SIZE:2;
      uint64_t reservedSpace0:2;
      uint64_t DST_TRANSFER_SIZE:1;
      uint64_t DST_ADDR_INCR:1;
      uint64_t SRC_TRANSFER_SIZE:1;
      uint64_t SRC_ADDR_INCR:1;
      uint64_t WAIT_FOR_DEACT:2;
      uint64_t INV_DESCR:1;
      uint64_t SET_CAUSE:1;
      uint64_t PREEMPTABLE:1;
      uint64_t FLIPPING:1;
      uint64_t OPCODE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PING_CTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CURR_DATA_NR:16;
      uint64_t RESPONSE:3;
      uint64_t reservedSpace0:12;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PING_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PONG_SRC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PONG_DST;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_NR:16;
      uint64_t DATA_SIZE:2;
      uint64_t reservedSpace0:2;
      uint64_t DST_TRANSFER_SIZE:1;
      uint64_t DST_ADDR_INCR:1;
      uint64_t SRC_TRANSFER_SIZE:1;
      uint64_t SRC_ADDR_INCR:1;
      uint64_t WAIT_FOR_DEACT:2;
      uint64_t INV_DESCR:1;
      uint64_t SET_CAUSE:1;
      uint64_t PREEMPTABLE:1;
      uint64_t FLIPPING:1;
      uint64_t OPCODE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PONG_CTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CURR_DATA_NR:16;
      uint64_t RESPONSE:3;
      uint64_t reservedSpace0:12;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PONG_STATUS;

};

#define DMAC_DESCR_1 (*(volatile struct DMAC_DESCR_1_tag *) 0x40101820)

struct DMAC_DESCR_2_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PING_SRC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PING_DST;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_NR:16;
      uint64_t DATA_SIZE:2;
      uint64_t reservedSpace0:2;
      uint64_t DST_TRANSFER_SIZE:1;
      uint64_t DST_ADDR_INCR:1;
      uint64_t SRC_TRANSFER_SIZE:1;
      uint64_t SRC_ADDR_INCR:1;
      uint64_t WAIT_FOR_DEACT:2;
      uint64_t INV_DESCR:1;
      uint64_t SET_CAUSE:1;
      uint64_t PREEMPTABLE:1;
      uint64_t FLIPPING:1;
      uint64_t OPCODE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PING_CTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CURR_DATA_NR:16;
      uint64_t RESPONSE:3;
      uint64_t reservedSpace0:12;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PING_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PONG_SRC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PONG_DST;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_NR:16;
      uint64_t DATA_SIZE:2;
      uint64_t reservedSpace0:2;
      uint64_t DST_TRANSFER_SIZE:1;
      uint64_t DST_ADDR_INCR:1;
      uint64_t SRC_TRANSFER_SIZE:1;
      uint64_t SRC_ADDR_INCR:1;
      uint64_t WAIT_FOR_DEACT:2;
      uint64_t INV_DESCR:1;
      uint64_t SET_CAUSE:1;
      uint64_t PREEMPTABLE:1;
      uint64_t FLIPPING:1;
      uint64_t OPCODE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PONG_CTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CURR_DATA_NR:16;
      uint64_t RESPONSE:3;
      uint64_t reservedSpace0:12;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PONG_STATUS;

