iSYSTEMLabs/winIDEAExampleWorkspaces/Cypress/PSoC4HVPA/emptyTargetInit/PSoC4HV_SFR.h
};

#define DMAC_DESCR_5 (*(volatile struct DMAC_DESCR_5_tag *) 0x401018a0)

struct DMAC_DESCR_6_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PING_SRC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PING_DST;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_NR:16;
      uint64_t DATA_SIZE:2;
      uint64_t reservedSpace0:2;
      uint64_t DST_TRANSFER_SIZE:1;
      uint64_t DST_ADDR_INCR:1;
      uint64_t SRC_TRANSFER_SIZE:1;
      uint64_t SRC_ADDR_INCR:1;
      uint64_t WAIT_FOR_DEACT:2;
      uint64_t INV_DESCR:1;
      uint64_t SET_CAUSE:1;
      uint64_t PREEMPTABLE:1;
      uint64_t FLIPPING:1;
      uint64_t OPCODE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PING_CTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CURR_DATA_NR:16;
      uint64_t RESPONSE:3;
      uint64_t reservedSpace0:12;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PING_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PONG_SRC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PONG_DST;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_NR:16;
      uint64_t DATA_SIZE:2;
      uint64_t reservedSpace0:2;
      uint64_t DST_TRANSFER_SIZE:1;
      uint64_t DST_ADDR_INCR:1;
      uint64_t SRC_TRANSFER_SIZE:1;
      uint64_t SRC_ADDR_INCR:1;
      uint64_t WAIT_FOR_DEACT:2;
      uint64_t INV_DESCR:1;
      uint64_t SET_CAUSE:1;
      uint64_t PREEMPTABLE:1;
      uint64_t FLIPPING:1;
      uint64_t OPCODE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PONG_CTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CURR_DATA_NR:16;
      uint64_t RESPONSE:3;
      uint64_t reservedSpace0:12;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PONG_STATUS;

};

#define DMAC_DESCR_6 (*(volatile struct DMAC_DESCR_6_tag *) 0x401018c0)

struct DMAC_DESCR_7_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PING_SRC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PING_DST;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_NR:16;
      uint64_t DATA_SIZE:2;
      uint64_t reservedSpace0:2;
      uint64_t DST_TRANSFER_SIZE:1;
      uint64_t DST_ADDR_INCR:1;
      uint64_t SRC_TRANSFER_SIZE:1;
      uint64_t SRC_ADDR_INCR:1;
      uint64_t WAIT_FOR_DEACT:2;
      uint64_t INV_DESCR:1;
      uint64_t SET_CAUSE:1;
      uint64_t PREEMPTABLE:1;
      uint64_t FLIPPING:1;
      uint64_t OPCODE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PING_CTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CURR_DATA_NR:16;
      uint64_t RESPONSE:3;
      uint64_t reservedSpace0:12;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PING_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PONG_SRC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PONG_DST;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_NR:16;
      uint64_t DATA_SIZE:2;
      uint64_t reservedSpace0:2;
      uint64_t DST_TRANSFER_SIZE:1;
      uint64_t DST_ADDR_INCR:1;
      uint64_t SRC_TRANSFER_SIZE:1;
      uint64_t SRC_ADDR_INCR:1;
      uint64_t WAIT_FOR_DEACT:2;
      uint64_t INV_DESCR:1;
      uint64_t SET_CAUSE:1;
      uint64_t PREEMPTABLE:1;
      uint64_t FLIPPING:1;
      uint64_t OPCODE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PONG_CTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CURR_DATA_NR:16;
      uint64_t RESPONSE:3;
      uint64_t reservedSpace0:12;
      uint64_t VALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PONG_STATUS;

};

#define DMAC_DESCR_7 (*(volatile struct DMAC_DESCR_7_tag *) 0x401018e0)

struct SPCIF_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLASH:14;
      uint64_t SFLASH:6;
      uint64_t NUM_FLASH:2;
      uint64_t FLASH_ROW:2;
      uint64_t NVL:7;
      uint64_t DE_CPD_LP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GEOMETRY;

  uint8_t res0[24];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVL_WR_DATA;

  uint8_t res1[2000];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIMER:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIMER:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTR_SET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIMER:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTR_MASK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIMER:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTR_MASKED;

};

#define SPCIF (*(volatile struct SPCIF_tag *) 0x40110000)

struct TCPWM_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNTER_ENABLED:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTRL;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNTER_CAPTURE:8;
      uint64_t COUNTER_RELOAD:8;
      uint64_t COUNTER_STOP:8;
      uint64_t COUNTER_START:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNTER_INT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTR_CAUSE;

