iSYSTEMLabs/winIDEAExampleWorkspaces/Cypress/PSoC4HVPA/emptyTargetInit/PSoC4HV_SFR.h
};

#define TCPWM_CNT_1 (*(volatile struct TCPWM_CNT_1_tag *) 0x40200140)

struct TCPWM_CNT_2_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t AUTO_RELOAD_CC:1;
      uint64_t AUTO_RELOAD_PERIOD:1;
      uint64_t PWM_SYNC_KILL:1;
      uint64_t PWM_STOP_ON_KILL:1;
      uint64_t reservedSpace0:4;
      uint64_t GENERIC:8;
      uint64_t UP_DOWN_MODE:2;
      uint64_t ONE_SHOT:1;
      uint64_t reservedSpace1:1;
      uint64_t QUADRATURE_MODE:2;
      uint64_t reservedSpace2:2;
      uint64_t MODE:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DOWN:1;
      uint64_t reservedSpace0:7;
      uint64_t GENERIC:8;
      uint64_t reservedSpace1:15;
      uint64_t RUNNING:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNTER:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COUNTER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CC:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CC:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CC_BUFF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PERIOD:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PERIOD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PERIOD:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PERIOD_BUFF;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CAPTURE_SEL:4;
      uint64_t COUNT_SEL:4;
      uint64_t RELOAD_SEL:4;
      uint64_t STOP_SEL:4;
      uint64_t START_SEL:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TR_CTRL0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CAPTURE_EDGE:2;
      uint64_t COUNT_EDGE:2;
      uint64_t RELOAD_EDGE:2;
      uint64_t STOP_EDGE:2;
      uint64_t START_EDGE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TR_CTRL1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CC_MATCH_MODE:2;
      uint64_t OVERFLOW_MODE:2;
      uint64_t UNDERFLOW_MODE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TR_CTRL2;

  uint8_t res1[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TC:1;
      uint64_t CC_MATCH:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TC:1;
      uint64_t CC_MATCH:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTR_SET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TC:1;
      uint64_t CC_MATCH:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTR_MASK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TC:1;
      uint64_t CC_MATCH:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTR_MASKED;

};

#define TCPWM_CNT_2 (*(volatile struct TCPWM_CNT_2_tag *) 0x40200180)

struct TCPWM_CNT_3_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t AUTO_RELOAD_CC:1;
      uint64_t AUTO_RELOAD_PERIOD:1;
      uint64_t PWM_SYNC_KILL:1;
      uint64_t PWM_STOP_ON_KILL:1;
      uint64_t reservedSpace0:4;
      uint64_t GENERIC:8;
      uint64_t UP_DOWN_MODE:2;
      uint64_t ONE_SHOT:1;
      uint64_t reservedSpace1:1;
      uint64_t QUADRATURE_MODE:2;
      uint64_t reservedSpace2:2;
      uint64_t MODE:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DOWN:1;
      uint64_t reservedSpace0:7;
      uint64_t GENERIC:8;
      uint64_t reservedSpace1:15;
      uint64_t RUNNING:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNTER:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COUNTER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CC:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CC:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CC_BUFF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PERIOD:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PERIOD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PERIOD:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PERIOD_BUFF;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CAPTURE_SEL:4;
      uint64_t COUNT_SEL:4;
      uint64_t RELOAD_SEL:4;
      uint64_t STOP_SEL:4;
      uint64_t START_SEL:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TR_CTRL0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CAPTURE_EDGE:2;
      uint64_t COUNT_EDGE:2;
      uint64_t RELOAD_EDGE:2;
      uint64_t STOP_EDGE:2;
      uint64_t START_EDGE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TR_CTRL1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CC_MATCH_MODE:2;
      uint64_t OVERFLOW_MODE:2;
      uint64_t UNDERFLOW_MODE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TR_CTRL2;

  uint8_t res1[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TC:1;
      uint64_t CC_MATCH:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TC:1;
      uint64_t CC_MATCH:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTR_SET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TC:1;
      uint64_t CC_MATCH:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTR_MASK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TC:1;
      uint64_t CC_MATCH:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTR_MASKED;

