iSYSTEMLabs/winIDEAExampleWorkspaces/Cypress/PSoC4HVPA/emptyTargetInit/PSoC4HV_SFR.h
};

#define TCPWM_CNT_3 (*(volatile struct TCPWM_CNT_3_tag *) 0x402001c0)

struct TCPWM_CNT_4_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t AUTO_RELOAD_CC:1;
      uint64_t AUTO_RELOAD_PERIOD:1;
      uint64_t PWM_SYNC_KILL:1;
      uint64_t PWM_STOP_ON_KILL:1;
      uint64_t reservedSpace0:4;
      uint64_t GENERIC:8;
      uint64_t UP_DOWN_MODE:2;
      uint64_t ONE_SHOT:1;
      uint64_t reservedSpace1:1;
      uint64_t QUADRATURE_MODE:2;
      uint64_t reservedSpace2:2;
      uint64_t MODE:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DOWN:1;
      uint64_t reservedSpace0:7;
      uint64_t GENERIC:8;
      uint64_t reservedSpace1:15;
      uint64_t RUNNING:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNTER:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COUNTER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CC:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CC:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CC_BUFF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PERIOD:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PERIOD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PERIOD:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PERIOD_BUFF;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CAPTURE_SEL:4;
      uint64_t COUNT_SEL:4;
      uint64_t RELOAD_SEL:4;
      uint64_t STOP_SEL:4;
      uint64_t START_SEL:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TR_CTRL0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CAPTURE_EDGE:2;
      uint64_t COUNT_EDGE:2;
      uint64_t RELOAD_EDGE:2;
      uint64_t STOP_EDGE:2;
      uint64_t START_EDGE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TR_CTRL1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CC_MATCH_MODE:2;
      uint64_t OVERFLOW_MODE:2;
      uint64_t UNDERFLOW_MODE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TR_CTRL2;

  uint8_t res1[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TC:1;
      uint64_t CC_MATCH:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TC:1;
      uint64_t CC_MATCH:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTR_SET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TC:1;
      uint64_t CC_MATCH:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTR_MASK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TC:1;
      uint64_t CC_MATCH:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTR_MASKED;

};

#define TCPWM_CNT_4 (*(volatile struct TCPWM_CNT_4_tag *) 0x40200200)

struct SCB_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t OVS:4;
      uint64_t reservedSpace0:4;
      uint64_t EC_AM_MODE:1;
      uint64_t EC_OP_MODE:1;
      uint64_t EZ_MODE:1;
      uint64_t BYTE_MODE:1;
      uint64_t CMD_RESP_MODE:1;
      uint64_t reservedSpace1:3;
      uint64_t ADDR_ACCEPT:1;
      uint64_t BLOCK:1;
      uint64_t reservedSpace2:6;
      uint64_t MODE:2;
      uint64_t reservedSpace3:5;
      uint64_t ENABLED:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EC_BUSY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BASE_RD_ADDR:9;
      uint64_t reservedSpace0:7;
      uint64_t BASE_WR_ADDR:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMD_RESP_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CURR_RD_ADDR:9;
      uint64_t reservedSpace0:7;
      uint64_t CURR_WR_ADDR:9;
      uint64_t reservedSpace1:5;
      uint64_t CMD_RESP_EC_BUS_BUSY:1;
      uint64_t CMD_RESP_EC_BUSY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMD_RESP_STATUS;

  uint8_t res0[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONTINUOUS:1;
      uint64_t SELECT_PRECEDE:1;
      uint64_t CPHA:1;
      uint64_t CPOL:1;
      uint64_t LATE_MISO_SAMPLE:1;
      uint64_t SCLK_CONTINUOUS:1;
      uint64_t reservedSpace0:2;
      uint64_t SSEL_POLARITY0:1;
      uint64_t SSEL_POLARITY1:1;
      uint64_t SSEL_POLARITY2:1;
      uint64_t SSEL_POLARITY3:1;
      uint64_t reservedSpace1:4;
      uint64_t LOOPBACK:1;
      uint64_t reservedSpace2:7;
      uint64_t MODE:2;
      uint64_t SLAVE_SELECT:2;
      uint64_t reservedSpace3:3;
      uint64_t MASTER_MODE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPI_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BUS_BUSY:1;
      uint64_t SPI_EC_BUSY:1;
      uint64_t reservedSpace0:6;
      uint64_t CURR_EZ_ADDR:8;
      uint64_t BASE_EZ_ADDR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPI_STATUS;

  uint8_t res1[24];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t LOOPBACK:1;
      uint64_t reservedSpace1:7;
      uint64_t MODE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STOP_BITS:3;
      uint64_t reservedSpace0:1;
      uint64_t PARITY:1;
      uint64_t PARITY_ENABLED:1;
      uint64_t reservedSpace1:2;
      uint64_t RETRY_ON_NACK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART_TX_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STOP_BITS:3;
      uint64_t reservedSpace0:1;
      uint64_t PARITY:1;
      uint64_t PARITY_ENABLED:1;
      uint64_t POLARITY:1;
      uint64_t reservedSpace1:1;
      uint64_t DROP_ON_PARITY_ERROR:1;
      uint64_t DROP_ON_FRAME_ERROR:1;
      uint64_t MP_MODE:1;
      uint64_t reservedSpace2:1;
      uint64_t LIN_MODE:1;
      uint64_t SKIP_START:1;
      uint64_t reservedSpace3:2;
      uint64_t BREAK_WIDTH:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART_RX_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BR_COUNTER:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART_RX_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRIGGER_LEVEL:8;
      uint64_t reservedSpace0:8;
      uint64_t RTS_POLARITY:1;
      uint64_t reservedSpace1:7;
      uint64_t CTS_POLARITY:1;
      uint64_t CTS_ENABLED:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UART_FLOW_CTRL;

