iSYSTEMLabs/winIDEAExampleWorkspaces/Cypress/PSoC4HVPA/emptyTargetInit/PSoC4HV_SFR.h
  uint8_t res2[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HIGH_PHASE_OVS:4;
      uint64_t LOW_PHASE_OVS:4;
      uint64_t M_READY_DATA_ACK:1;
      uint64_t M_NOT_READY_DATA_NACK:1;
      uint64_t reservedSpace0:1;
      uint64_t S_GENERAL_IGNORE:1;
      uint64_t S_READY_ADDR_ACK:1;
      uint64_t S_READY_DATA_ACK:1;
      uint64_t S_NOT_READY_ADDR_NACK:1;
      uint64_t S_NOT_READY_DATA_NACK:1;
      uint64_t LOOPBACK:1;
      uint64_t reservedSpace1:13;
      uint64_t SLAVE_MODE:1;
      uint64_t MASTER_MODE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I2C_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BUS_BUSY:1;
      uint64_t I2C_EC_BUSY:1;
      uint64_t reservedSpace0:2;
      uint64_t S_READ:1;
      uint64_t M_READ:1;
      uint64_t reservedSpace1:2;
      uint64_t CURR_EZ_ADDR:8;
      uint64_t BASE_EZ_ADDR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I2C_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t M_START:1;
      uint64_t M_START_ON_IDLE:1;
      uint64_t M_ACK:1;
      uint64_t M_NACK:1;
      uint64_t M_STOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I2C_M_CMD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t S_ACK:1;
      uint64_t S_NACK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I2C_S_CMD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SDA_IN_FILT_TRIM:2;
      uint64_t reservedSpace0:2;
      uint64_t SDA_IN_FILT_SEL:1;
      uint64_t reservedSpace1:3;
      uint64_t SCL_IN_FILT_TRIM:2;
      uint64_t reservedSpace2:2;
      uint64_t SCL_IN_FILT_SEL:1;
      uint64_t reservedSpace3:3;
      uint64_t SDA_OUT_FILT0_TRIM:2;
      uint64_t SDA_OUT_FILT1_TRIM:2;
      uint64_t SDA_OUT_FILT2_TRIM:2;
      uint64_t reservedSpace4:6;
      uint64_t SDA_OUT_FILT_SEL:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I2C_CFG;

  uint8_t res3[396];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_WIDTH:4;
      uint64_t reservedSpace0:4;
      uint64_t MSB_FIRST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TX_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRIGGER_LEVEL:8;
      uint64_t reservedSpace0:8;
      uint64_t CLEAR:1;
      uint64_t FREEZE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TX_FIFO_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t USED:9;
      uint64_t reservedSpace0:6;
      uint64_t SR_VALID:1;
      uint64_t RD_PTR:8;
      uint64_t WR_PTR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TX_FIFO_STATUS;

  uint8_t res4[52];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TX_FIFO_WR;

  uint8_t res5[188];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_WIDTH:4;
      uint64_t reservedSpace0:4;
      uint64_t MSB_FIRST:1;
      uint64_t MEDIAN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RX_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRIGGER_LEVEL:8;
      uint64_t reservedSpace0:8;
      uint64_t CLEAR:1;
      uint64_t FREEZE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RX_FIFO_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t USED:9;
      uint64_t reservedSpace0:6;
      uint64_t SR_VALID:1;
      uint64_t RD_PTR:8;
      uint64_t WR_PTR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RX_FIFO_STATUS;

  uint8_t res6[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDR:8;
      uint64_t reservedSpace0:8;
      uint64_t MASK:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RX_MATCH;

  uint8_t res7[44];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RX_FIFO_RD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RX_FIFO_RD_SILENT;

  uint8_t res8[2744];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t M:1;
      uint64_t S:1;
      uint64_t TX:1;
      uint64_t RX:1;
      uint64_t I2C_EC:1;
      uint64_t SPI_EC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTR_CAUSE;

  uint8_t res9[124];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WAKE_UP:1;
      uint64_t EZ_STOP:1;
      uint64_t EZ_WRITE_STOP:1;
      uint64_t EZ_READ_STOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTR_I2C_EC;

  uint8_t res10[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WAKE_UP:1;
      uint64_t EZ_STOP:1;
      uint64_t EZ_WRITE_STOP:1;
      uint64_t EZ_READ_STOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTR_I2C_EC_MASK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WAKE_UP:1;
      uint64_t EZ_STOP:1;
      uint64_t EZ_WRITE_STOP:1;
      uint64_t EZ_READ_STOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTR_I2C_EC_MASKED;

  uint8_t res11[48];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WAKE_UP:1;
      uint64_t EZ_STOP:1;
      uint64_t EZ_WRITE_STOP:1;
      uint64_t EZ_READ_STOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTR_SPI_EC;

  uint8_t res12[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WAKE_UP:1;
      uint64_t EZ_STOP:1;
      uint64_t EZ_WRITE_STOP:1;
      uint64_t EZ_READ_STOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTR_SPI_EC_MASK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WAKE_UP:1;
      uint64_t EZ_STOP:1;
      uint64_t EZ_WRITE_STOP:1;
      uint64_t EZ_READ_STOP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTR_SPI_EC_MASKED;

  uint8_t res13[48];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t I2C_ARB_LOST:1;
      uint64_t I2C_NACK:1;
      uint64_t I2C_ACK:1;
      uint64_t reservedSpace0:1;
      uint64_t I2C_STOP:1;
      uint64_t reservedSpace1:3;
      uint64_t I2C_BUS_ERROR:1;
      uint64_t SPI_DONE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTR_M;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t I2C_ARB_LOST:1;
      uint64_t I2C_NACK:1;
      uint64_t I2C_ACK:1;
      uint64_t reservedSpace0:1;
      uint64_t I2C_STOP:1;
      uint64_t reservedSpace1:3;
      uint64_t I2C_BUS_ERROR:1;
      uint64_t SPI_DONE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTR_M_SET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t I2C_ARB_LOST:1;
      uint64_t I2C_NACK:1;
      uint64_t I2C_ACK:1;
      uint64_t reservedSpace0:1;
      uint64_t I2C_STOP:1;
      uint64_t reservedSpace1:3;
      uint64_t I2C_BUS_ERROR:1;
      uint64_t SPI_DONE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTR_M_MASK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t I2C_ARB_LOST:1;
      uint64_t I2C_NACK:1;
      uint64_t I2C_ACK:1;
      uint64_t reservedSpace0:1;
      uint64_t I2C_STOP:1;
      uint64_t reservedSpace1:3;
      uint64_t I2C_BUS_ERROR:1;
      uint64_t SPI_DONE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTR_M_MASKED;

  uint8_t res14[48];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t I2C_ARB_LOST:1;
      uint64_t I2C_NACK:1;
      uint64_t I2C_ACK:1;
      uint64_t I2C_WRITE_STOP:1;
      uint64_t I2C_STOP:1;
      uint64_t I2C_START:1;
      uint64_t I2C_ADDR_MATCH:1;
      uint64_t I2C_GENERAL:1;
      uint64_t I2C_BUS_ERROR:1;
      uint64_t SPI_EZ_WRITE_STOP:1;
      uint64_t SPI_EZ_STOP:1;
      uint64_t SPI_BUS_ERROR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTR_S;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t I2C_ARB_LOST:1;
      uint64_t I2C_NACK:1;
      uint64_t I2C_ACK:1;
      uint64_t I2C_WRITE_STOP:1;
      uint64_t I2C_STOP:1;
      uint64_t I2C_START:1;
      uint64_t I2C_ADDR_MATCH:1;
      uint64_t I2C_GENERAL:1;
      uint64_t I2C_BUS_ERROR:1;
      uint64_t SPI_EZ_WRITE_STOP:1;
      uint64_t SPI_EZ_STOP:1;
      uint64_t SPI_BUS_ERROR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTR_S_SET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t I2C_ARB_LOST:1;
      uint64_t I2C_NACK:1;
      uint64_t I2C_ACK:1;
      uint64_t I2C_WRITE_STOP:1;
      uint64_t I2C_STOP:1;
      uint64_t I2C_START:1;
      uint64_t I2C_ADDR_MATCH:1;
      uint64_t I2C_GENERAL:1;
      uint64_t I2C_BUS_ERROR:1;
      uint64_t SPI_EZ_WRITE_STOP:1;
      uint64_t SPI_EZ_STOP:1;
      uint64_t SPI_BUS_ERROR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTR_S_MASK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t I2C_ARB_LOST:1;
      uint64_t I2C_NACK:1;
      uint64_t I2C_ACK:1;
      uint64_t I2C_WRITE_STOP:1;
      uint64_t I2C_STOP:1;
      uint64_t I2C_START:1;
      uint64_t I2C_ADDR_MATCH:1;
      uint64_t I2C_GENERAL:1;
      uint64_t I2C_BUS_ERROR:1;
      uint64_t SPI_EZ_WRITE_STOP:1;
      uint64_t SPI_EZ_STOP:1;
      uint64_t SPI_BUS_ERROR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTR_S_MASKED;

