iSYSTEMLabs/winIDEAExampleWorkspaces/Cypress/PSoC4HVPA/emptyTargetInit/PSoC4HV_SFR.h
  uint8_t res15[48];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRIGGER:1;
      uint64_t NOT_FULL:1;
      uint64_t reservedSpace0:2;
      uint64_t EMPTY:1;
      uint64_t OVERFLOW:1;
      uint64_t UNDERFLOW:1;
      uint64_t BLOCKED:1;
      uint64_t UART_NACK:1;
      uint64_t UART_DONE:1;
      uint64_t UART_ARB_LOST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTR_TX;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRIGGER:1;
      uint64_t NOT_FULL:1;
      uint64_t reservedSpace0:2;
      uint64_t EMPTY:1;
      uint64_t OVERFLOW:1;
      uint64_t UNDERFLOW:1;
      uint64_t BLOCKED:1;
      uint64_t UART_NACK:1;
      uint64_t UART_DONE:1;
      uint64_t UART_ARB_LOST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTR_TX_SET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRIGGER:1;
      uint64_t NOT_FULL:1;
      uint64_t reservedSpace0:2;
      uint64_t EMPTY:1;
      uint64_t OVERFLOW:1;
      uint64_t UNDERFLOW:1;
      uint64_t BLOCKED:1;
      uint64_t UART_NACK:1;
      uint64_t UART_DONE:1;
      uint64_t UART_ARB_LOST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTR_TX_MASK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRIGGER:1;
      uint64_t NOT_FULL:1;
      uint64_t reservedSpace0:2;
      uint64_t EMPTY:1;
      uint64_t OVERFLOW:1;
      uint64_t UNDERFLOW:1;
      uint64_t BLOCKED:1;
      uint64_t UART_NACK:1;
      uint64_t UART_DONE:1;
      uint64_t UART_ARB_LOST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTR_TX_MASKED;

  uint8_t res16[48];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRIGGER:1;
      uint64_t reservedSpace0:1;
      uint64_t NOT_EMPTY:1;
      uint64_t FULL:1;
      uint64_t reservedSpace1:1;
      uint64_t OVERFLOW:1;
      uint64_t UNDERFLOW:1;
      uint64_t BLOCKED:1;
      uint64_t FRAME_ERROR:1;
      uint64_t PARITY_ERROR:1;
      uint64_t BAUD_DETECT:1;
      uint64_t BREAK_DETECT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTR_RX;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRIGGER:1;
      uint64_t reservedSpace0:1;
      uint64_t NOT_EMPTY:1;
      uint64_t FULL:1;
      uint64_t reservedSpace1:1;
      uint64_t OVERFLOW:1;
      uint64_t UNDERFLOW:1;
      uint64_t BLOCKED:1;
      uint64_t FRAME_ERROR:1;
      uint64_t PARITY_ERROR:1;
      uint64_t BAUD_DETECT:1;
      uint64_t BREAK_DETECT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTR_RX_SET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRIGGER:1;
      uint64_t reservedSpace0:1;
      uint64_t NOT_EMPTY:1;
      uint64_t FULL:1;
      uint64_t reservedSpace1:1;
      uint64_t OVERFLOW:1;
      uint64_t UNDERFLOW:1;
      uint64_t BLOCKED:1;
      uint64_t FRAME_ERROR:1;
      uint64_t PARITY_ERROR:1;
      uint64_t BAUD_DETECT:1;
      uint64_t BREAK_DETECT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTR_RX_MASK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRIGGER:1;
      uint64_t reservedSpace0:1;
      uint64_t NOT_EMPTY:1;
      uint64_t FULL:1;
      uint64_t reservedSpace1:1;
      uint64_t OVERFLOW:1;
      uint64_t UNDERFLOW:1;
      uint64_t BLOCKED:1;
      uint64_t FRAME_ERROR:1;
      uint64_t PARITY_ERROR:1;
      uint64_t BAUD_DETECT:1;
      uint64_t BREAK_DETECT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTR_RX_MASKED;

};

#define SCB (*(volatile struct SCB_tag *) 0x40240000)

struct LIN0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t CH_IDX:5;
      uint64_t reservedSpace0:11;
      uint64_t TX_SYNC_ERROR:1;
      uint64_t TX_SYNC_STOP_ERROR:1;
      uint64_t TX_PARITY_ERROR:1;
      uint64_t TX_PID_STOP_ERROR:1;
      uint64_t reservedSpace1:1;
      uint64_t TX_DATA_STOP_ERROR:1;
      uint64_t TX_CHECKSUM_ERROR:1;
      uint64_t TX_CHECKSUM_STOP_ERROR:1;
      uint64_t reservedSpace2:7;
      uint64_t ENABLED:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERROR_CTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CH_IDX:5;
      uint64_t reservedSpace0:11;
      uint64_t MODE:1;
      uint64_t reservedSpace1:14;
      uint64_t ENABLED:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TEST_CTL;

};

#define LIN0 (*(volatile struct LIN0_tag *) 0x402d0000)

struct LIN0_CH_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t STOP_BITS:2;
      uint64_t reservedSpace0:2;
      uint64_t AUTO_EN:1;
      uint64_t reservedSpace1:3;
      uint64_t BREAK_DELIMITER_LENGTH:2;
      uint64_t reservedSpace2:6;
      uint64_t BREAK_WAKEUP_LENGTH:5;
      uint64_t reservedSpace3:3;
      uint64_t MODE:1;
      uint64_t reservedSpace4:2;
      uint64_t BIT_ERROR_IGNORE:1;
      uint64_t PARITY:1;
      uint64_t PARITY_EN:1;
      uint64_t FILTER_EN:1;
      uint64_t ENABLED:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTL0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_NR:3;
      uint64_t reservedSpace0:5;
      uint64_t CHECKSUM_ENHANCED:1;
      uint64_t reservedSpace1:7;
      uint64_t FRAME_TIMEOUT:8;
      uint64_t FRAME_TIMEOUT_SEL:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTL1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_IDX:4;
      uint64_t HEADER_RESPONSE:1;
      uint64_t RX_DATA0_FRAME_ERROR:1;
      uint64_t reservedSpace0:2;
      uint64_t TX_BUSY:1;
      uint64_t RX_BUSY:1;
      uint64_t reservedSpace1:2;
      uint64_t TX_DONE:1;
      uint64_t RX_DONE:1;
      uint64_t reservedSpace2:2;
      uint64_t TX_HEADER_BIT_ERROR:1;
      uint64_t TX_RESPONSE_BIT_ERROR:1;
      uint64_t reservedSpace3:6;
      uint64_t RX_HEADER_FRAME_ERROR:1;
      uint64_t RX_HEADER_SYNC_ERROR:1;
      uint64_t RX_HEADER_PARITY_ERROR:1;
      uint64_t RX_RESPONSE_FRAME_ERROR:1;
      uint64_t RX_RESPONSE_CHECKSUM_ERROR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATUS;

