iSYSTEMLabs/winIDEAExampleWorkspaces/Cypress/PSoC4HVPA/emptyTargetInit/PSoC4HV_SFR.h
  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TX_HEADER:1;
      uint64_t TX_RESPONSE:1;
      uint64_t TX_WAKEUP:1;
      uint64_t reservedSpace0:5;
      uint64_t RX_HEADER:1;
      uint64_t RX_RESPONSE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMD;

  uint8_t res1[76];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYNC_COUNTER:8;
      uint64_t reservedSpace0:8;
      uint64_t TX_IN:1;
      uint64_t RX_IN:1;
      uint64_t reservedSpace1:6;
      uint64_t TX_OUT:1;
      uint64_t reservedSpace2:1;
      uint64_t EN_OUT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TX_RX_STATUS;

  uint8_t res2[28];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PID:8;
      uint64_t CHECKSUM:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PID_CHECKSUM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA1:8;
      uint64_t DATA2:8;
      uint64_t DATA3:8;
      uint64_t DATA4:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DATA0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA5:8;
      uint64_t DATA6:8;
      uint64_t DATA7:8;
      uint64_t DATA8:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DATA1;

  uint8_t res3[52];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TX_HEADER_DONE:1;
      uint64_t TX_RESPONSE_DONE:1;
      uint64_t TX_WAKEUP_DONE:1;
      uint64_t reservedSpace0:5;
      uint64_t RX_HEADER_DONE:1;
      uint64_t RX_RESPONSE_DONE:1;
      uint64_t RX_BREAK_WAKEUP_DONE:1;
      uint64_t RX_HEADER_SYNC_DONE:1;
      uint64_t reservedSpace1:1;
      uint64_t RX_NOISE_DETECT:1;
      uint64_t TIMEOUT:1;
      uint64_t reservedSpace2:1;
      uint64_t TX_HEADER_BIT_ERROR:1;
      uint64_t TX_RESPONSE_BIT_ERROR:1;
      uint64_t reservedSpace3:6;
      uint64_t RX_HEADER_FRAME_ERROR:1;
      uint64_t RX_HEADER_SYNC_ERROR:1;
      uint64_t RX_HEADER_PARITY_ERROR:1;
      uint64_t RX_RESPONSE_FRAME_ERROR:1;
      uint64_t RX_RESPONSE_CHECKSUM_ERROR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TX_HEADER_DONE:1;
      uint64_t TX_RESPONSE_DONE:1;
      uint64_t TX_WAKEUP_DONE:1;
      uint64_t reservedSpace0:5;
      uint64_t RX_HEADER_DONE:1;
      uint64_t RX_RESPONSE_DONE:1;
      uint64_t RX_BREAK_WAKEUP_DONE:1;
      uint64_t RX_HEADER_SYNC_DONE:1;
      uint64_t reservedSpace1:1;
      uint64_t RX_NOISE_DETECT:1;
      uint64_t TIMEOUT:1;
      uint64_t reservedSpace2:1;
      uint64_t TX_HEADER_BIT_ERROR:1;
      uint64_t TX_RESPONSE_BIT_ERROR:1;
      uint64_t reservedSpace3:6;
      uint64_t RX_HEADER_FRAME_ERROR:1;
      uint64_t RX_HEADER_SYNC_ERROR:1;
      uint64_t RX_HEADER_PARITY_ERROR:1;
      uint64_t RX_RESPONSE_FRAME_ERROR:1;
      uint64_t RX_RESPONSE_CHECKSUM_ERROR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTR_SET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TX_HEADER_DONE:1;
      uint64_t TX_RESPONSE_DONE:1;
      uint64_t TX_WAKEUP_DONE:1;
      uint64_t reservedSpace0:5;
      uint64_t RX_HEADER_DONE:1;
      uint64_t RX_RESPONSE_DONE:1;
      uint64_t RX_BREAK_WAKEUP_DONE:1;
      uint64_t RX_HEADER_SYNC_DONE:1;
      uint64_t reservedSpace1:1;
      uint64_t RX_NOISE_DETECT:1;
      uint64_t TIMEOUT:1;
      uint64_t reservedSpace2:1;
      uint64_t TX_HEADER_BIT_ERROR:1;
      uint64_t TX_RESPONSE_BIT_ERROR:1;
      uint64_t reservedSpace3:6;
      uint64_t RX_HEADER_FRAME_ERROR:1;
      uint64_t RX_HEADER_SYNC_ERROR:1;
      uint64_t RX_HEADER_PARITY_ERROR:1;
      uint64_t RX_RESPONSE_FRAME_ERROR:1;
      uint64_t RX_RESPONSE_CHECKSUM_ERROR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTR_MASK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TX_HEADER_DONE:1;
      uint64_t TX_RESPONSE_DONE:1;
      uint64_t TX_WAKEUP_DONE:1;
      uint64_t reservedSpace0:5;
      uint64_t RX_HEADER_DONE:1;
      uint64_t RX_RESPONSE_DONE:1;
      uint64_t RX_BREAK_WAKEUP_DONE:1;
      uint64_t RX_HEADER_SYNC_DONE:1;
      uint64_t reservedSpace1:1;
      uint64_t RX_NOISE_DETECT:1;
      uint64_t TIMEOUT:1;
      uint64_t reservedSpace2:1;
      uint64_t TX_HEADER_BIT_ERROR:1;
      uint64_t TX_RESPONSE_BIT_ERROR:1;
      uint64_t reservedSpace3:6;
      uint64_t RX_HEADER_FRAME_ERROR:1;
      uint64_t RX_HEADER_SYNC_ERROR:1;
      uint64_t RX_HEADER_PARITY_ERROR:1;
      uint64_t RX_RESPONSE_FRAME_ERROR:1;
      uint64_t RX_RESPONSE_CHECKSUM_ERROR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTR_MASKED;

};

#define LIN0_CH_0 (*(volatile struct LIN0_CH_0_tag *) 0x402d8000)

struct LIN0_CH_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t STOP_BITS:2;
      uint64_t reservedSpace0:2;
      uint64_t AUTO_EN:1;
      uint64_t reservedSpace1:3;
      uint64_t BREAK_DELIMITER_LENGTH:2;
      uint64_t reservedSpace2:6;
      uint64_t BREAK_WAKEUP_LENGTH:5;
      uint64_t reservedSpace3:3;
      uint64_t MODE:1;
      uint64_t reservedSpace4:2;
      uint64_t BIT_ERROR_IGNORE:1;
      uint64_t PARITY:1;
      uint64_t PARITY_EN:1;
      uint64_t FILTER_EN:1;
      uint64_t ENABLED:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTL0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_NR:3;
      uint64_t reservedSpace0:5;
      uint64_t CHECKSUM_ENHANCED:1;
      uint64_t reservedSpace1:7;
      uint64_t FRAME_TIMEOUT:8;
      uint64_t FRAME_TIMEOUT_SEL:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTL1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_IDX:4;
      uint64_t HEADER_RESPONSE:1;
      uint64_t RX_DATA0_FRAME_ERROR:1;
      uint64_t reservedSpace0:2;
      uint64_t TX_BUSY:1;
      uint64_t RX_BUSY:1;
      uint64_t reservedSpace1:2;
      uint64_t TX_DONE:1;
      uint64_t RX_DONE:1;
      uint64_t reservedSpace2:2;
      uint64_t TX_HEADER_BIT_ERROR:1;
      uint64_t TX_RESPONSE_BIT_ERROR:1;
      uint64_t reservedSpace3:6;
      uint64_t RX_HEADER_FRAME_ERROR:1;
      uint64_t RX_HEADER_SYNC_ERROR:1;
      uint64_t RX_HEADER_PARITY_ERROR:1;
      uint64_t RX_RESPONSE_FRAME_ERROR:1;
      uint64_t RX_RESPONSE_CHECKSUM_ERROR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATUS;

