iSYSTEMLabs/winIDEAExampleWorkspaces/Cypress/PSoC4HVPA/emptyTargetInit/PSoC4HV_SFR.h
  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TX_HEADER:1;
      uint64_t TX_RESPONSE:1;
      uint64_t TX_WAKEUP:1;
      uint64_t reservedSpace0:5;
      uint64_t RX_HEADER:1;
      uint64_t RX_RESPONSE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMD;

  uint8_t res1[76];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYNC_COUNTER:8;
      uint64_t reservedSpace0:8;
      uint64_t TX_IN:1;
      uint64_t RX_IN:1;
      uint64_t reservedSpace1:6;
      uint64_t TX_OUT:1;
      uint64_t reservedSpace2:1;
      uint64_t EN_OUT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TX_RX_STATUS;

  uint8_t res2[28];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PID:8;
      uint64_t CHECKSUM:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PID_CHECKSUM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA1:8;
      uint64_t DATA2:8;
      uint64_t DATA3:8;
      uint64_t DATA4:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DATA0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA5:8;
      uint64_t DATA6:8;
      uint64_t DATA7:8;
      uint64_t DATA8:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DATA1;

  uint8_t res3[52];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TX_HEADER_DONE:1;
      uint64_t TX_RESPONSE_DONE:1;
      uint64_t TX_WAKEUP_DONE:1;
      uint64_t reservedSpace0:5;
      uint64_t RX_HEADER_DONE:1;
      uint64_t RX_RESPONSE_DONE:1;
      uint64_t RX_BREAK_WAKEUP_DONE:1;
      uint64_t RX_HEADER_SYNC_DONE:1;
      uint64_t reservedSpace1:1;
      uint64_t RX_NOISE_DETECT:1;
      uint64_t TIMEOUT:1;
      uint64_t reservedSpace2:1;
      uint64_t TX_HEADER_BIT_ERROR:1;
      uint64_t TX_RESPONSE_BIT_ERROR:1;
      uint64_t reservedSpace3:6;
      uint64_t RX_HEADER_FRAME_ERROR:1;
      uint64_t RX_HEADER_SYNC_ERROR:1;
      uint64_t RX_HEADER_PARITY_ERROR:1;
      uint64_t RX_RESPONSE_FRAME_ERROR:1;
      uint64_t RX_RESPONSE_CHECKSUM_ERROR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TX_HEADER_DONE:1;
      uint64_t TX_RESPONSE_DONE:1;
      uint64_t TX_WAKEUP_DONE:1;
      uint64_t reservedSpace0:5;
      uint64_t RX_HEADER_DONE:1;
      uint64_t RX_RESPONSE_DONE:1;
      uint64_t RX_BREAK_WAKEUP_DONE:1;
      uint64_t RX_HEADER_SYNC_DONE:1;
      uint64_t reservedSpace1:1;
      uint64_t RX_NOISE_DETECT:1;
      uint64_t TIMEOUT:1;
      uint64_t reservedSpace2:1;
      uint64_t TX_HEADER_BIT_ERROR:1;
      uint64_t TX_RESPONSE_BIT_ERROR:1;
      uint64_t reservedSpace3:6;
      uint64_t RX_HEADER_FRAME_ERROR:1;
      uint64_t RX_HEADER_SYNC_ERROR:1;
      uint64_t RX_HEADER_PARITY_ERROR:1;
      uint64_t RX_RESPONSE_FRAME_ERROR:1;
      uint64_t RX_RESPONSE_CHECKSUM_ERROR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTR_SET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TX_HEADER_DONE:1;
      uint64_t TX_RESPONSE_DONE:1;
      uint64_t TX_WAKEUP_DONE:1;
      uint64_t reservedSpace0:5;
      uint64_t RX_HEADER_DONE:1;
      uint64_t RX_RESPONSE_DONE:1;
      uint64_t RX_BREAK_WAKEUP_DONE:1;
      uint64_t RX_HEADER_SYNC_DONE:1;
      uint64_t reservedSpace1:1;
      uint64_t RX_NOISE_DETECT:1;
      uint64_t TIMEOUT:1;
      uint64_t reservedSpace2:1;
      uint64_t TX_HEADER_BIT_ERROR:1;
      uint64_t TX_RESPONSE_BIT_ERROR:1;
      uint64_t reservedSpace3:6;
      uint64_t RX_HEADER_FRAME_ERROR:1;
      uint64_t RX_HEADER_SYNC_ERROR:1;
      uint64_t RX_HEADER_PARITY_ERROR:1;
      uint64_t RX_RESPONSE_FRAME_ERROR:1;
      uint64_t RX_RESPONSE_CHECKSUM_ERROR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTR_MASK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TX_HEADER_DONE:1;
      uint64_t TX_RESPONSE_DONE:1;
      uint64_t TX_WAKEUP_DONE:1;
      uint64_t reservedSpace0:5;
      uint64_t RX_HEADER_DONE:1;
      uint64_t RX_RESPONSE_DONE:1;
      uint64_t RX_BREAK_WAKEUP_DONE:1;
      uint64_t RX_HEADER_SYNC_DONE:1;
      uint64_t reservedSpace1:1;
      uint64_t RX_NOISE_DETECT:1;
      uint64_t TIMEOUT:1;
      uint64_t reservedSpace2:1;
      uint64_t TX_HEADER_BIT_ERROR:1;
      uint64_t TX_RESPONSE_BIT_ERROR:1;
      uint64_t reservedSpace3:6;
      uint64_t RX_HEADER_FRAME_ERROR:1;
      uint64_t RX_HEADER_SYNC_ERROR:1;
      uint64_t RX_HEADER_PARITY_ERROR:1;
      uint64_t RX_RESPONSE_FRAME_ERROR:1;
      uint64_t RX_RESPONSE_CHECKSUM_ERROR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTR_MASKED;

};

#define LIN0_CH_1 (*(volatile struct LIN0_CH_1_tag *) 0x402d8100)

struct PACSS_DCHAN_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t DEC_EN:1;
      uint64_t PP_EN:1;
      uint64_t AGC_GAIN_EN:1;
      uint64_t reservedSpace0:1;
      uint64_t FIR_NUM_TAPS:6;
      uint64_t reservedSpace1:2;
      uint64_t FIR_EN:2;
      uint64_t reservedSpace2:16;
      uint64_t SEC_EN:1;
      uint64_t ENABLE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCHAN_CTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ACHAN_SEL:1;
      uint64_t reservedSpace0:3;
      uint64_t POS_PIN_SEL:7;
      uint64_t reservedSpace1:1;
      uint64_t NEG_PIN_SEL:5;
      uint64_t BYPASS_AAF:1;
      uint64_t OTHER_ACHAN_SEL:1;
      uint64_t reservedSpace2:1;
      uint64_t CH_SEL_DLY:8;
      uint64_t AAF_SHORT_R_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SMP_CTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SINC_MODE:1;
      uint64_t CONV_MODE:1;
      uint64_t OCOR_EN:1;
      uint64_t GCOR_EN:1;
      uint64_t DR:7;
      uint64_t reservedSpace0:1;
      uint64_t SHIFTL:4;
      uint64_t DR2:5;
      uint64_t reservedSpace1:3;
      uint64_t DEC_SHIFTR:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DEC_CTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AVG_MODE:3;
      uint64_t MOV_SUM:1;
      uint64_t SHIFTR:4;
      uint64_t CLAMP_VALUE:5;
      uint64_t reservedSpace0:3;
      uint64_t RANGE_DET_EN:2;
      uint64_t SAT_EN:1;
      uint64_t reservedSpace1:1;
      uint64_t RANGE_COND:2;
      uint64_t reservedSpace2:2;
      uint64_t RANGE_CNT_VAL:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PP_CTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OCOR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OFST_COR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GCOR:16;
      uint64_t GVAL:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GAIN_COR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RANGE_LOW:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RANGE_LOW;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RANGE_HIGH:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RANGE_HIGH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GAIN:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PGA_GAIN_CTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FCAP1:7;
      uint64_t FCAP1OFFSET:1;
      uint64_t FCAP1_EN:1;
      uint64_t reservedSpace0:3;
      uint64_t FCAP2:4;
      uint64_t FCAP2_EN:1;
      uint64_t reservedSpace1:3;
      uint64_t FCAP3:4;
      uint64_t FCAP3_EN:1;
      uint64_t reservedSpace2:3;
      uint64_t RESCAP:3;
      uint64_t RESCAP_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAP_CFG0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DACCAP:6;
      uint64_t DACCAP_EN:1;
      uint64_t reservedSpace0:1;
      uint64_t IPCAP1:7;
      uint64_t IPCAP1OFFSET:1;
      uint64_t IPCAP1_EN:1;
      uint64_t reservedSpace1:3;
      uint64_t IPCAP2:3;
      uint64_t IPCAP2_EN:1;
      uint64_t IPCAP3:3;
      uint64_t IPCAP3_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAP_CFG1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SUMCAPIN:5;
      uint64_t SUMCAPIN_EN:1;
      uint64_t reservedSpace0:2;
      uint64_t SUMCAP1:3;
      uint64_t SUMCAP1_EN:1;
      uint64_t SUMCAP2:3;
      uint64_t SUMCAP2_EN:1;
      uint64_t SUMCAP3:3;
      uint64_t SUMCAP3_EN:1;
      uint64_t SUMCAPFB:4;
      uint64_t SUMCAPFB_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAP_CFG2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ACC_THRESH:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ACC_THRESH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RSVD0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RESERVED_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESULT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RESULT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RSVD1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RESERVED_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ACC_RESULT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ACC_RESULT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_VAL_INTR:1;
      uint64_t OVERFLOW_INTR:1;
      uint64_t FWT_COLLISION_INTR:1;
      uint64_t HWT_COLLISION_INTR:1;
      uint64_t OVERLOAD_INTR:1;
      uint64_t SATURATE_INTR:1;
      uint64_t ACC_THRESH_INTR:1;
      uint64_t RANGE_INTR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_VAL_SET:1;
      uint64_t OVERFLOW_SET:1;
      uint64_t FWT_COLLISION_SET:1;
      uint64_t HWT_COLLISION_SET:1;
      uint64_t OVERLOAD_SET:1;
      uint64_t SATURATE_SET:1;
      uint64_t ACC_THRESH_SET:1;
      uint64_t RANGE_SET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTR_SET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_VAL_MASK:1;
      uint64_t OVERFLOW_MASK:1;
      uint64_t FWT_COLLISION_MASK:1;
      uint64_t HWT_COLLISION_MASK:1;
      uint64_t OVERLOAD_MASK:1;
      uint64_t SATURATE_MASK:1;
      uint64_t ACC_THRESH_MASK:1;
      uint64_t RANGE_MASK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTR_MASK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_VAL_MASKED:1;
      uint64_t OVERFLOW_MASKED:1;
      uint64_t FWT_COLLISION_MASKED:1;
      uint64_t HWT_COLLSION_MASKED:1;
      uint64_t OVERLOAD_MASKED:1;
      uint64_t SATURATE_MASKED:1;
      uint64_t ACC_THRESH_MASKED:1;
      uint64_t RANGE_MASKED:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTR_MASKED;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OVERLOAD_CAUSE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATUS;

