iSYSTEMLabs/winIDEAExampleWorkspaces/Cypress/PSoC4HVPA/emptyTargetInit/PSoC4HV_SFR.h
};

#define PACSS_DCHAN_2 (*(volatile struct PACSS_DCHAN_2_tag *) 0x40320000)

struct PACSS_DCHAN_2_FCFG_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t COEF:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COEF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CVAL:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CVAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TAP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TAP;

};

#define PACSS_DCHAN_2_FCFG (*(volatile struct PACSS_DCHAN_2_FCFG_tag *) 0x40320100)

struct PACSS_DCHAN_3_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t DEC_EN:1;
      uint64_t PP_EN:1;
      uint64_t AGC_GAIN_EN:1;
      uint64_t reservedSpace0:1;
      uint64_t FIR_NUM_TAPS:6;
      uint64_t reservedSpace1:2;
      uint64_t FIR_EN:2;
      uint64_t reservedSpace2:16;
      uint64_t SEC_EN:1;
      uint64_t ENABLE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCHAN_CTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ACHAN_SEL:1;
      uint64_t reservedSpace0:3;
      uint64_t POS_PIN_SEL:7;
      uint64_t reservedSpace1:1;
      uint64_t NEG_PIN_SEL:5;
      uint64_t BYPASS_AAF:1;
      uint64_t OTHER_ACHAN_SEL:1;
      uint64_t reservedSpace2:1;
      uint64_t CH_SEL_DLY:8;
      uint64_t AAF_SHORT_R_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SMP_CTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SINC_MODE:1;
      uint64_t CONV_MODE:1;
      uint64_t OCOR_EN:1;
      uint64_t GCOR_EN:1;
      uint64_t DR:7;
      uint64_t reservedSpace0:1;
      uint64_t SHIFTL:4;
      uint64_t DR2:5;
      uint64_t reservedSpace1:3;
      uint64_t DEC_SHIFTR:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DEC_CTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AVG_MODE:3;
      uint64_t MOV_SUM:1;
      uint64_t SHIFTR:4;
      uint64_t CLAMP_VALUE:5;
      uint64_t reservedSpace0:3;
      uint64_t RANGE_DET_EN:2;
      uint64_t SAT_EN:1;
      uint64_t reservedSpace1:1;
      uint64_t RANGE_COND:2;
      uint64_t reservedSpace2:2;
      uint64_t RANGE_CNT_VAL:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PP_CTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OCOR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OFST_COR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GCOR:16;
      uint64_t GVAL:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GAIN_COR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RANGE_LOW:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RANGE_LOW;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RANGE_HIGH:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RANGE_HIGH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GAIN:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PGA_GAIN_CTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FCAP1:7;
      uint64_t FCAP1OFFSET:1;
      uint64_t FCAP1_EN:1;
      uint64_t reservedSpace0:3;
      uint64_t FCAP2:4;
      uint64_t FCAP2_EN:1;
      uint64_t reservedSpace1:3;
      uint64_t FCAP3:4;
      uint64_t FCAP3_EN:1;
      uint64_t reservedSpace2:3;
      uint64_t RESCAP:3;
      uint64_t RESCAP_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAP_CFG0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DACCAP:6;
      uint64_t DACCAP_EN:1;
      uint64_t reservedSpace0:1;
      uint64_t IPCAP1:7;
      uint64_t IPCAP1OFFSET:1;
      uint64_t IPCAP1_EN:1;
      uint64_t reservedSpace1:3;
      uint64_t IPCAP2:3;
      uint64_t IPCAP2_EN:1;
      uint64_t IPCAP3:3;
      uint64_t IPCAP3_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAP_CFG1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SUMCAPIN:5;
      uint64_t SUMCAPIN_EN:1;
      uint64_t reservedSpace0:2;
      uint64_t SUMCAP1:3;
      uint64_t SUMCAP1_EN:1;
      uint64_t SUMCAP2:3;
      uint64_t SUMCAP2_EN:1;
      uint64_t SUMCAP3:3;
      uint64_t SUMCAP3_EN:1;
      uint64_t SUMCAPFB:4;
      uint64_t SUMCAPFB_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CAP_CFG2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ACC_THRESH:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ACC_THRESH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RSVD0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RESERVED_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESULT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RESULT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RSVD1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RESERVED_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ACC_RESULT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ACC_RESULT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_VAL_INTR:1;
      uint64_t OVERFLOW_INTR:1;
      uint64_t FWT_COLLISION_INTR:1;
      uint64_t HWT_COLLISION_INTR:1;
      uint64_t OVERLOAD_INTR:1;
      uint64_t SATURATE_INTR:1;
      uint64_t ACC_THRESH_INTR:1;
      uint64_t RANGE_INTR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_VAL_SET:1;
      uint64_t OVERFLOW_SET:1;
      uint64_t FWT_COLLISION_SET:1;
      uint64_t HWT_COLLISION_SET:1;
      uint64_t OVERLOAD_SET:1;
      uint64_t SATURATE_SET:1;
      uint64_t ACC_THRESH_SET:1;
      uint64_t RANGE_SET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTR_SET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_VAL_MASK:1;
      uint64_t OVERFLOW_MASK:1;
      uint64_t FWT_COLLISION_MASK:1;
      uint64_t HWT_COLLISION_MASK:1;
      uint64_t OVERLOAD_MASK:1;
      uint64_t SATURATE_MASK:1;
      uint64_t ACC_THRESH_MASK:1;
      uint64_t RANGE_MASK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTR_MASK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA_VAL_MASKED:1;
      uint64_t OVERFLOW_MASKED:1;
      uint64_t FWT_COLLISION_MASKED:1;
      uint64_t HWT_COLLSION_MASKED:1;
      uint64_t OVERLOAD_MASKED:1;
      uint64_t SATURATE_MASKED:1;
      uint64_t ACC_THRESH_MASKED:1;
      uint64_t RANGE_MASKED:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTR_MASKED;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OVERLOAD_CAUSE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATUS;

