iSYSTEMLabs/winIDEAExampleWorkspaces/Cypress/PSoC4HVPA/emptyTargetInit/PSoC4HV_SFR.h
};

#define PACSS_DCHAN_3 (*(volatile struct PACSS_DCHAN_3_tag *) 0x40330000)

struct PACSS_DCHAN_3_FCFG_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t COEF:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COEF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CVAL:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CVAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TAP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TAP;

};

#define PACSS_DCHAN_3_FCFG (*(volatile struct PACSS_DCHAN_3_FCFG_tag *) 0x40330100)

struct PACSS_ACHAN_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t MOD_EN:1;
      uint64_t PGA_EN:1;
      uint64_t BUF_EN:1;
      uint64_t REG_EN:1;
      uint64_t REF_EN:1;
      uint64_t INMUX_EN:1;
      uint64_t DMUX_EN:1;
      uint64_t CLKGEN_EN:1;
      uint64_t VCCA_RES_EN:1;
      uint64_t VDDA_RES_EN:1;
      uint64_t VCM_BUF_EN:1;
      uint64_t VREF_BUF_EN:1;
      uint64_t reservedSpace0:19;
      uint64_t ENABLE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ACHAN_CTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRIM_TR_SEL:2;
      uint64_t SYNC_PRIM_TR:1;
      uint64_t PRIM_TR_EN:1;
      uint64_t PEND_SEC_TR_SEL:2;
      uint64_t SYNC_SEC_TR:1;
      uint64_t PEND_SEC_TR_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TR_CTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SMP_CNT:4;
      uint64_t reservedSpace0:4;
      uint64_t AAF_SHORT_R_CNT:8;
      uint64_t DEC_BLANK_CNT:8;
      uint64_t CH_CHOP_EN:1;
      uint64_t reservedSpace1:3;
      uint64_t CIRCUIT_CHOP:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHOP_CTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PGA_PWR_LEVELS:2;
      uint64_t reservedSpace0:6;
      uint64_t PGA_CHOP_EN:1;
      uint64_t PGA_IDAC_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PGA_CTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t POWER1:3;
      uint64_t reservedSpace0:1;
      uint64_t POWER2_3:3;
      uint64_t reservedSpace1:1;
      uint64_t POWER_COMP:2;
      uint64_t reservedSpace2:2;
      uint64_t POWER_SUM:3;
      uint64_t reservedSpace3:1;
      uint64_t OPAMP1_BW:4;
      uint64_t reservedSpace4:4;
      uint64_t MOD_FCHOP:3;
      uint64_t MOD_CHOP_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MOD_CTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t QLEV:2;
      uint64_t NONOV:2;
      uint64_t reservedSpace0:4;
      uint64_t ODET_TH:5;
      uint64_t OD_EN:1;
      uint64_t DPMODE:2;
      uint64_t DP_FCHOP:3;
      uint64_t DP_CHOP_EN:1;
      uint64_t RESET1_EN:1;
      uint64_t RESET2_EN:1;
      uint64_t RESET3_EN:1;
      uint64_t reservedSpace1:1;
      uint64_t MX_DOUT:2;
      uint64_t reservedSpace2:3;
      uint64_t SIGN:1;
      uint64_t AAF_CHOP_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DPATH_CTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BUF_PWR_LEVELS:2;
      uint64_t reservedSpace0:2;
      uint64_t BUF_CHOP_EN:1;
      uint64_t BUF_IDAC_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BUF_CTL;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VPOS_PWR_MODE:3;
      uint64_t VPOS_BYPASS_EN:1;
      uint64_t VNEG_PWR_MODE:2;
      uint64_t reservedSpace0:2;
      uint64_t CLOCK_SEL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PUMP_CTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VREF_PWR:2;
      uint64_t VCM_PWR:2;
      uint64_t VCM_SEL:2;
      uint64_t VREF_QTZ_SEL:1;
      uint64_t reservedSpace0:1;
      uint64_t VREFH_SEL:3;
      uint64_t reservedSpace1:1;
      uint64_t VREFL_SEL:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REF_CTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t START_PRIM:1;
      uint64_t reservedSpace0:7;
      uint64_t PEND_SEC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) START;

};

#define PACSS_ACHAN_0 (*(volatile struct PACSS_ACHAN_0_tag *) 0x40340000)

struct PACSS_ACHAN_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t MOD_EN:1;
      uint64_t PGA_EN:1;
      uint64_t BUF_EN:1;
      uint64_t REG_EN:1;
      uint64_t REF_EN:1;
      uint64_t INMUX_EN:1;
      uint64_t DMUX_EN:1;
      uint64_t CLKGEN_EN:1;
      uint64_t VCCA_RES_EN:1;
      uint64_t VDDA_RES_EN:1;
      uint64_t VCM_BUF_EN:1;
      uint64_t VREF_BUF_EN:1;
      uint64_t reservedSpace0:19;
      uint64_t ENABLE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ACHAN_CTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRIM_TR_SEL:2;
      uint64_t SYNC_PRIM_TR:1;
      uint64_t PRIM_TR_EN:1;
      uint64_t PEND_SEC_TR_SEL:2;
      uint64_t SYNC_SEC_TR:1;
      uint64_t PEND_SEC_TR_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TR_CTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SMP_CNT:4;
      uint64_t reservedSpace0:4;
      uint64_t AAF_SHORT_R_CNT:8;
      uint64_t DEC_BLANK_CNT:8;
      uint64_t CH_CHOP_EN:1;
      uint64_t reservedSpace1:3;
      uint64_t CIRCUIT_CHOP:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHOP_CTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PGA_PWR_LEVELS:2;
      uint64_t reservedSpace0:6;
      uint64_t PGA_CHOP_EN:1;
      uint64_t PGA_IDAC_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PGA_CTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t POWER1:3;
      uint64_t reservedSpace0:1;
      uint64_t POWER2_3:3;
      uint64_t reservedSpace1:1;
      uint64_t POWER_COMP:2;
      uint64_t reservedSpace2:2;
      uint64_t POWER_SUM:3;
      uint64_t reservedSpace3:1;
      uint64_t OPAMP1_BW:4;
      uint64_t reservedSpace4:4;
      uint64_t MOD_FCHOP:3;
      uint64_t MOD_CHOP_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MOD_CTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t QLEV:2;
      uint64_t NONOV:2;
      uint64_t reservedSpace0:4;
      uint64_t ODET_TH:5;
      uint64_t OD_EN:1;
      uint64_t DPMODE:2;
      uint64_t DP_FCHOP:3;
      uint64_t DP_CHOP_EN:1;
      uint64_t RESET1_EN:1;
      uint64_t RESET2_EN:1;
      uint64_t RESET3_EN:1;
      uint64_t reservedSpace1:1;
      uint64_t MX_DOUT:2;
      uint64_t reservedSpace2:3;
      uint64_t SIGN:1;
      uint64_t AAF_CHOP_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DPATH_CTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BUF_PWR_LEVELS:2;
      uint64_t reservedSpace0:2;
      uint64_t BUF_CHOP_EN:1;
      uint64_t BUF_IDAC_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BUF_CTL;

