iSYSTEMLabs/winIDEAExampleWorkspaces/Cypress/PSoC4HVPA/emptyTargetInit/PSoC4HV_SFR.h
  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VPOS_PWR_MODE:3;
      uint64_t VPOS_BYPASS_EN:1;
      uint64_t VNEG_PWR_MODE:2;
      uint64_t reservedSpace0:2;
      uint64_t CLOCK_SEL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PUMP_CTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VREF_PWR:2;
      uint64_t VCM_PWR:2;
      uint64_t VCM_SEL:2;
      uint64_t VREF_QTZ_SEL:1;
      uint64_t reservedSpace0:1;
      uint64_t VREFH_SEL:3;
      uint64_t reservedSpace1:1;
      uint64_t VREFL_SEL:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REF_CTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t START_PRIM:1;
      uint64_t reservedSpace0:7;
      uint64_t PEND_SEC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) START;

};

#define PACSS_ACHAN_1 (*(volatile struct PACSS_ACHAN_1_tag *) 0x40350000)

struct PACSS_MMIO_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t RSVD0:2;
      uint64_t AGC_EN:1;
      uint64_t SEQ_EN:1;
      uint64_t TMPS_EN:1;
      uint64_t reservedSpace0:3;
      uint64_t HVDIVG_MUX_SEL:2;
      uint64_t reservedSpace1:21;
      uint64_t ENABLE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PACSS_CTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCH_DR_EN:1;
      uint64_t RSVD1:1;
      uint64_t RSVD2:1;
      uint64_t reservedSpace0:1;
      uint64_t DR:7;
      uint64_t reservedSpace1:1;
      uint64_t DR2:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEQ_CTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LO_THRESH:8;
      uint64_t HI_THRESH:8;
      uint64_t INIT_LVL:4;
      uint64_t MIN_LVL:4;
      uint64_t MAX_LVL:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AGC0_CTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FAST_DR:5;
      uint64_t reservedSpace0:2;
      uint64_t AAF_BLANK_MODE:1;
      uint64_t AAF_BLANK_CNT:8;
      uint64_t DEC_BLANK_CNT:8;
      uint64_t SCALER_BLANK_CNT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AGC1_CTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IREF_SEL:1;
      uint64_t reservedSpace0:3;
      uint64_t IREF_UNIT:4;
      uint64_t LOAD_MODE:2;
      uint64_t reservedSpace1:2;
      uint64_t BIPOLAR_UNIT:4;
      uint64_t reservedSpace2:4;
      uint64_t AMUXA_SEL:1;
      uint64_t AMUXB_SEL:1;
      uint64_t VTEMP_SUP_SEL:1;
      uint64_t VTEMP_SEL:1;
      uint64_t VTEMP_RET_SEL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TMPS_CTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t START_PRIM:1;
      uint64_t reservedSpace0:7;
      uint64_t PEND_SEC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) START;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCH0_INT:1;
      uint64_t DCH1_INT:1;
      uint64_t DCH2_INT:1;
      uint64_t DCH3_INT:1;
      uint64_t PILO_INT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTR_CAUSE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEQ_BUSY:2;
      uint64_t reservedSpace0:2;
      uint64_t AGC_CURR_CH:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATUS;

  uint8_t res0[736];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LEAKC_DIS:1;
      uint64_t CTAT_SEL:1;
      uint64_t reservedSpace0:2;
      uint64_t CTAT_SW:1;
      uint64_t reservedSpace1:11;
      uint64_t ADFT_SEL:2;
      uint64_t reservedSpace2:13;
      uint64_t IMO_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HPOSC_CTL;

  uint8_t res1[252];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t DFT_SEL:2;
      uint64_t reservedSpace1:2;
      uint64_t DFT_IVREFP_ENB:1;
      uint64_t DFT_IVREFC_ENB:1;
      uint64_t DFT_IVCP_ENB:1;
      uint64_t DFT_IVCC_ENB:1;
      uint64_t DFT_EN:1;
      uint64_t reservedSpace2:5;
      uint64_t WAKEUP_TIMER_EN:1;
      uint64_t ILO_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PILO_CTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WAKEUP_COUNT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PILO_TIMER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WAKEUP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PILO_INTR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WAKEUP_SET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PILO_INTR_SET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WAKEUP_MASK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PILO_INTR_MASK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WAKEUP_MASKED:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PILO_INTR_MASKED;

  uint8_t res2[232];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHOP_DIS:1;
      uint64_t CHOP_CLK_SEL:1;
      uint64_t CHOP_POS:1;
      uint64_t reservedSpace0:1;
      uint64_t NL_COREC_DIS:1;
      uint64_t SEL_PHC:1;
      uint64_t reservedSpace1:10;
      uint64_t ADFT_MODE:3;
      uint64_t reservedSpace2:12;
      uint64_t VBG_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HPBGR_CTL;

  uint8_t res3[256];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:30;
      uint64_t LP_MODE:1;
      uint64_t AREF_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AREF1_CTL;

};

#define PACSS_MMIO (*(volatile struct PACSS_MMIO_tag *) 0x403f0000)

struct PACSS_MMIO_GAINLVL_STRUCT_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PGA_GAIN:3;
      uint64_t reservedSpace0:1;
      uint64_t SHIFT1:4;
      uint64_t reservedSpace1:8;
      uint64_t DACCAP:6;
      uint64_t reservedSpace2:2;
      uint64_t IPCAP1:7;
      uint64_t IPCAP1OFFSET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GAIN_CFG0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SUMCAPIN:5;
      uint64_t reservedSpace0:3;
      uint64_t SUMCAP1:3;
      uint64_t reservedSpace1:1;
      uint64_t SUMCAP2:3;
      uint64_t reservedSpace2:1;
      uint64_t SUMCAP3:3;
      uint64_t reservedSpace3:1;
      uint64_t SUMCAPFB:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GAIN_CFG1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OCOR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OFST_COR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GCOR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GAIN_COR;

