iSYSTEMLabs/winIDEAExampleWorkspaces/Cypress/PSoC4HVPA/emptyTargetInit/PSoC4HV_SFR.h
};

#define PACSS_MMIO_GAINLVL_STRUCT_0 (*(volatile struct PACSS_MMIO_GAINLVL_STRUCT_0_tag *) 0x403f0100)

struct PACSS_MMIO_GAINLVL_STRUCT_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PGA_GAIN:3;
      uint64_t reservedSpace0:1;
      uint64_t SHIFT1:4;
      uint64_t reservedSpace1:8;
      uint64_t DACCAP:6;
      uint64_t reservedSpace2:2;
      uint64_t IPCAP1:7;
      uint64_t IPCAP1OFFSET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GAIN_CFG0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SUMCAPIN:5;
      uint64_t reservedSpace0:3;
      uint64_t SUMCAP1:3;
      uint64_t reservedSpace1:1;
      uint64_t SUMCAP2:3;
      uint64_t reservedSpace2:1;
      uint64_t SUMCAP3:3;
      uint64_t reservedSpace3:1;
      uint64_t SUMCAPFB:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GAIN_CFG1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OCOR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OFST_COR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GCOR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GAIN_COR;

};

#define PACSS_MMIO_GAINLVL_STRUCT_1 (*(volatile struct PACSS_MMIO_GAINLVL_STRUCT_1_tag *) 0x403f0110)

struct PACSS_MMIO_GAINLVL_STRUCT_2_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PGA_GAIN:3;
      uint64_t reservedSpace0:1;
      uint64_t SHIFT1:4;
      uint64_t reservedSpace1:8;
      uint64_t DACCAP:6;
      uint64_t reservedSpace2:2;
      uint64_t IPCAP1:7;
      uint64_t IPCAP1OFFSET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GAIN_CFG0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SUMCAPIN:5;
      uint64_t reservedSpace0:3;
      uint64_t SUMCAP1:3;
      uint64_t reservedSpace1:1;
      uint64_t SUMCAP2:3;
      uint64_t reservedSpace2:1;
      uint64_t SUMCAP3:3;
      uint64_t reservedSpace3:1;
      uint64_t SUMCAPFB:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GAIN_CFG1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OCOR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OFST_COR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GCOR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GAIN_COR;

};

#define PACSS_MMIO_GAINLVL_STRUCT_2 (*(volatile struct PACSS_MMIO_GAINLVL_STRUCT_2_tag *) 0x403f0120)

struct PACSS_MMIO_GAINLVL_STRUCT_3_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PGA_GAIN:3;
      uint64_t reservedSpace0:1;
      uint64_t SHIFT1:4;
      uint64_t reservedSpace1:8;
      uint64_t DACCAP:6;
      uint64_t reservedSpace2:2;
      uint64_t IPCAP1:7;
      uint64_t IPCAP1OFFSET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GAIN_CFG0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SUMCAPIN:5;
      uint64_t reservedSpace0:3;
      uint64_t SUMCAP1:3;
      uint64_t reservedSpace1:1;
      uint64_t SUMCAP2:3;
      uint64_t reservedSpace2:1;
      uint64_t SUMCAP3:3;
      uint64_t reservedSpace3:1;
      uint64_t SUMCAPFB:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GAIN_CFG1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OCOR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OFST_COR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GCOR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GAIN_COR;

};

#define PACSS_MMIO_GAINLVL_STRUCT_3 (*(volatile struct PACSS_MMIO_GAINLVL_STRUCT_3_tag *) 0x403f0130)

struct PACSS_MMIO_GAINLVL_STRUCT_4_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PGA_GAIN:3;
      uint64_t reservedSpace0:1;
      uint64_t SHIFT1:4;
      uint64_t reservedSpace1:8;
      uint64_t DACCAP:6;
      uint64_t reservedSpace2:2;
      uint64_t IPCAP1:7;
      uint64_t IPCAP1OFFSET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GAIN_CFG0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SUMCAPIN:5;
      uint64_t reservedSpace0:3;
      uint64_t SUMCAP1:3;
      uint64_t reservedSpace1:1;
      uint64_t SUMCAP2:3;
      uint64_t reservedSpace2:1;
      uint64_t SUMCAP3:3;
      uint64_t reservedSpace3:1;
      uint64_t SUMCAPFB:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GAIN_CFG1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OCOR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OFST_COR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GCOR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GAIN_COR;

};

#define PACSS_MMIO_GAINLVL_STRUCT_4 (*(volatile struct PACSS_MMIO_GAINLVL_STRUCT_4_tag *) 0x403f0140)

struct PACSS_MMIO_GAINLVL_STRUCT_5_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PGA_GAIN:3;
      uint64_t reservedSpace0:1;
      uint64_t SHIFT1:4;
      uint64_t reservedSpace1:8;
      uint64_t DACCAP:6;
      uint64_t reservedSpace2:2;
      uint64_t IPCAP1:7;
      uint64_t IPCAP1OFFSET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GAIN_CFG0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SUMCAPIN:5;
      uint64_t reservedSpace0:3;
      uint64_t SUMCAP1:3;
      uint64_t reservedSpace1:1;
      uint64_t SUMCAP2:3;
      uint64_t reservedSpace2:1;
      uint64_t SUMCAP3:3;
      uint64_t reservedSpace3:1;
      uint64_t SUMCAPFB:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GAIN_CFG1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OCOR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OFST_COR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GCOR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GAIN_COR;

};

#define PACSS_MMIO_GAINLVL_STRUCT_5 (*(volatile struct PACSS_MMIO_GAINLVL_STRUCT_5_tag *) 0x403f0150)

struct PACSS_MMIO_GAINLVL_STRUCT_6_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PGA_GAIN:3;
      uint64_t reservedSpace0:1;
      uint64_t SHIFT1:4;
      uint64_t reservedSpace1:8;
      uint64_t DACCAP:6;
      uint64_t reservedSpace2:2;
      uint64_t IPCAP1:7;
      uint64_t IPCAP1OFFSET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GAIN_CFG0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SUMCAPIN:5;
      uint64_t reservedSpace0:3;
      uint64_t SUMCAP1:3;
      uint64_t reservedSpace1:1;
      uint64_t SUMCAP2:3;
      uint64_t reservedSpace2:1;
      uint64_t SUMCAP3:3;
      uint64_t reservedSpace3:1;
      uint64_t SUMCAPFB:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GAIN_CFG1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OCOR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OFST_COR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GCOR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GAIN_COR;

